Repository: skimasax/prochatr
Catalog: public/ninja/locale/*/LC_MESSAGES/ninjafirewall_pro-*.po
Languages: fr_fr

source: Unable to retrieve updates information from NinjaFirewall server
fr_fr: Impossible de récupérer les informations de mise à jour depuis les serveurs de NinjaFirewall

source: Available updates
fr_fr: Mises à jour disponibles

source: Download this update
fr_fr: Télécharger cette mise à jour

source: Check for updates
fr_fr: Vérifier les mises à jour

source: Unable to connect to NinjaFirewall server: %s.
fr_fr: Impossible de se connecter au serveur de NinjaFirewall : %s.

source: The server returned the following HTTP code: %s %s.
fr_fr: Le serveur a retourné le code d'erreur HTTP suivant : %s %s.

source: The remote server returned the following error: %s.
fr_fr: Le serveur distant a retourné l'erreur suivante : %s.

source: Downloaded file is not a valid ZIP archive.
fr_fr: Le fichier téléchargé n'est par une archive ZIP valide.

source: Unable to extract the ZIP archive.
fr_fr: Impossible d'extraire les fichiers de l'archive ZIP.

source: Unable to find NinjaFirewall options file (conf/options.php).
fr_fr: Impossible de trouver le fichiers des options de NinjaFirewall (conf/options.php).

source: Unable to read NinjaFirewall options file (conf/options.php).
fr_fr: Impossible de lire le fichiers des options de NinjaFirewall (conf/options.php).

source: Unable to find NinjaFirewall rules file (conf/rules.php).
fr_fr: Impossible de trouver le fichiers des règles de NinjaFirewall (conf/rules.php).

source: Unable to read NinjaFirewall rules file (conf/rules.php).
fr_fr: Impossible de lire le fichiers des règles de NinjaFirewall (conf/rules.php).

source: Firewall has been disabled from the <a href="%s">administration console</a>.
fr_fr: Le pare-feu a été désactivé depuis son <a href="%s">interface d'administration</a>.

source: Unable to communicate with the firewall. Please check your settings.
fr_fr: Impossible de communiquer avec le pare-feu. Veuillez vérifiez votre configuration.

source: Sorry <b>%%REM_ADDRESS%%</b>, your request cannot be processed.<br />For security reasons, it was blocked and logged.<br /><br />If you believe this was an error please contact the<br />webmaster and enclose the following incident ID:
fr_fr: Désolé <b>%%REM_ADDRESS%%</b>, votre requête ne peut pas aboutir.<br />Pour des raisons de sécurité, elle a été bloquée et enregistrée.<br /><br />Si vous pensez qu'il s'agit d'une erreur, veuillez contacter<br />le webmaster et joindre le numéro d'incident suivant :

source: General
fr_fr: Général

source: Geolocation
fr_fr: Géolocalisation

source: IP Access Control
fr_fr: Contrôle d'accès IP

source: URL Access Control
fr_fr: Contrôle d'accès URL

source: Bot Access Control
fr_fr: Contrôle d'accès Bot

source: Whitelist the Administrator
fr_fr: Ajouter l'Administrateur à la liste blanche

source: You are whitelisted.
fr_fr: Vous êtes dans la liste blanche.

source: Current status for user %s
fr_fr: Statut actuel pour l'utilisateur %s

source: You are not whitelisted.
fr_fr: Vous n'êtes pas dans la liste blanche.

source: Source IP
fr_fr: IP Source

source: Retrieve visitors IP address from
fr_fr: Récupérer l'adresse IP des visiteurs depuis

source: Other
fr_fr: Autre

source: e.g.
fr_fr: ex :

source: Your server does not seem to support the %s variable.
fr_fr: Votre serveur ne semble pas utiliser la variable %s.

source: Scan traffic coming from localhost and private IP address spaces
fr_fr: Filtrer les connexions provenant de localhost et d'adresses IP privées

source: HTTP Methods
fr_fr: Méthodes HTTP

source: All Access Control directives should apply to the following HTTP methods
fr_fr: Toutes les directives du menu Contrôle d'Accès s'appliquent aux méthodes HTTP suivantes

source: Geolocation Access Control
fr_fr: Contrôle d'accès par Géolocalisation

source: Enable Geolocation
fr_fr: Activer la Géolocalisation

source: Enabled
fr_fr: Activé

source: Retrieve the ISO 3166 code from
fr_fr: Récupérer le code ISO 3166 du pays depuis

source: PHP variable
fr_fr: Variable PHP

source: Block the following ISO 3166 codes
fr_fr: Bloquer les codes ISO 3166 suivants

source: Total blocked items: %s
fr_fr: Nombre d'éléments bloqués : %s

source: Check all
fr_fr: Cocher tout

source: Uncheck all
fr_fr: Décocher tout

source: Geolocation should apply to the whole site or to specific URLs only?
fr_fr: S'il faut appliquer la Géolocalisation à tout le site ou à certains scripts uniquement ?

source: View allowed syntax
fr_fr: Afficher la syntaxe autorisée

source: Full or partial case-sensitive URL (e.g., %s).
fr_fr: URL complète ou partielle, sensible à la casse (ex : %s).

source: One item per line.
fr_fr: Une entrée par ligne.

source: Leave this field empty if you want geolocation to apply to all your PHP scripts.
fr_fr: Laissez ce champ vide pour appliquer la géolocalisation à tous les scripts PHP.

source: Add NINJA_COUNTRY_CODE to PHP headers
fr_fr: Ajouter NINJA_COUNTRY_CODE aux en-têtes PHP

source: Write event to the firewall log
fr_fr: Enregistrer l'événement dans le journal du pare-feu

source: Allow the following IP, CIDR or AS number
fr_fr: Accepter les IP, CIDR ou numéros d'AS suivants

source: IPv4 address: %s
fr_fr: Adresse IPv4 : %s

source: IPv4 CIDR: %s
fr_fr: CIDR IPv4 : %s

source: IPv6 address: %s
fr_fr: Adresse IPv6 : %s

source: IPv6 CIDR: %s
fr_fr: CIDR IPv6 : %s

source: Autonomous System number: %s
fr_fr: Numéro AS (Autonomous System) : %s

source: Whitelist:
fr_fr: Liste Blanche :

source: Enter one item per line.
fr_fr: Une entrée par ligne.

source: Block the following IP, CIDR or AS number
fr_fr: Bloquer les IP, CIDR ou numéros d'AS suivants

source: Blacklist:
fr_fr: Liste noire :

source: Rate limiting
fr_fr: Limiter le trafic

source: 5-second
fr_fr: 5 secondes

source: 10-second
fr_fr: 10 secondes

source: 15-second
fr_fr: 15 secondes

source: 30-second
fr_fr: 30 secondes

source: The maximum value for seconds and connections is 9999.
fr_fr: La valeur maximale pour les secondes et les connexions est 9999.

source: Allow access to the following URL
fr_fr: Autoriser l'accès à l'URL suivante

source: Full or partial case-sensitive URLs (e.g., %s).
fr_fr: URL complète ou partielle, sensible à la casse (ex : %s).

source: Block access to the following URL
fr_fr: Bloquer l'accès à l'URL suivante

source: Reject the following bots (HTTP_USER_AGENT)
fr_fr: Rejeter les bots suivants (HTTP_USER_AGENT)

source: A full or partial case-insensitive string.
fr_fr: Chaîne de caractère complète ou partielle, insensible à la casse.

source: Allowed characters are: <code>a-zA-Z</code> <code>0-9</code> <code>.</code> <code>-</code> <code>_</code> <code>:</code> <code>/</code> and <code>space</code>.
fr_fr: Cataractes autorisés : <code>a-zA-Z</code> <code>0-9</code> <code>.</code> <code>-</code> <code>_</code> <code>:</code> <code>/</code> et <code>espace</code>.

source: Blocked bots:
fr_fr: Bots bloqués :

source: Delete all items?
fr_fr: Supprimer tous les éléments ?

source: Clear list
fr_fr: Effacer la liste

source: The default list of bots will be restored. Continue?
fr_fr: Restaurer les valeurs par défaut de la liste des bots ?

source: Restore default bots list
fr_fr: Restaurer les valeurs par défaut

source: Save Changes
fr_fr: Sauvegarder les modifications

source: Restore Default Values
fr_fr: Rétablir les valeurs par défaut

source: All fields will be restored to their default values and any changes you made will be lost. Continue?
fr_fr: Tous les champs vont être re-initialisés et vos changements seront perdus. Continuer ?

source: Cannot write to the "./nfwlog/cache/" folder. Please make it writable.
fr_fr: Impossible d'écrire dans le répertoire "./nfwlog/cache/". Veuillez changer ses permissions afin qu'il soit accessible en écriture.

source: Warning: Your previous secret key was either corrupted or missing. A new one, as well as a new public key, were created.
fr_fr: Attention : votre clé privée était soit corrompue soit manquante. Un nouveau jeu de clés vient d'être créé.

source: Please enter the remote websites URL.
fr_fr: Veuillez entrer l'URL de vos sites distants.

source: Enable Centralized Logging
fr_fr: Activer la Centralisation des Logs

source: Secret key
fr_fr: Clé privée

source: From 30 to 100 ASCII printable characters.
fr_fr: De 30 à 100 caractères ASCII.

source: This server IP address
fr_fr: L'adresse IP de ce serveur

source: Only this IP address (IPv4 or IPv6) will be allowed to connect to the remote websites. If you don't want to restrict the access by IP, enter the <code>*</code> character instead.
fr_fr: Seule cette adresse IPv4 ou IPv6 sera autorisée à se connecter aux sites distants. Si vous ne souhaitez pas de restriction d’accès par IP, veuillez entrer le caractère <code>*</code>.

source: Public key
fr_fr: Clé publique

source: Add this key to the remote websites. <a href="%s">Consult our blog</a> for more info.
fr_fr: Vous devez configurer vos sites distants avec cette nouvelle clé. <a href="%s">Consultez notre blog</a> pour plus d'info.

source: Remote websites URL
fr_fr: URL de vos sites distants

source: Enter one URL per line, including the protocol (<code>http://</code> or <code>https://</code>). Only ASCII URLs are accepted.
fr_fr: Entrez une URL par ligne, en incluant le protocole (<code>http://</code> ou <code>https://</code>). Seules les URL au format ASCII sont acceptées.

source: New file
fr_fr: Nouveau fichier

source: Modified file
fr_fr: Fichier modifié

source: Deleted file
fr_fr: Fichier supprimé

source: Snapshot file successfully deleted.
fr_fr: L'instantané a bien été supprimé.

source: You did not create any snapshot yet.
fr_fr: Vous n'avez pas encore créé d'instantané.

source: Snapshot successfully created.
fr_fr: L'instantané a bien été créé.

source: You must create a snapshot first.
fr_fr: Vous devez d'abord créer un instantané.

source: NinjaFirewall detected that changes were made to your files.
fr_fr: NinjaFirewall a détecté des changements dans vos fichiers.

source: No changes detected.
fr_fr: Aucun changement n'a été détecté.

source: Create a snapshot of all files stored in that directory
fr_fr: Créer un instantané de tous les fichiers se trouvant dans ce répertoire

source: Exclude the following files/folders (optional)
fr_fr: Exclure les fichiers / dossiers suivants (optionnel)

source: Full or partial case-sensitive string(s). Multiple values must be comma-separated.
fr_fr: Chaîne de caractères complète ou partielle, sensible à la casse. Plusieurs valeurs doivent être séparées par des virgules.

source: Do not follow symbolic links (default)
fr_fr: Ne pas suivre les liens symboliques (défaut)

source: Create Snapshot
fr_fr: Créer un Instantané

source: Last snapshot
fr_fr: Dernier instantané

source: Created on: %s
fr_fr: Créé le : %s

source: Total files: %s
fr_fr: Nombre de fichiers : %s

source: Directory:
fr_fr: Répertoire :

source: Symlinks:
fr_fr: Lien symboliques :

source: follow
fr_fr: suivre

source: do not follow
fr_fr: ne pas suivre

source: Processing time: %s seconds
fr_fr: Temps de traitement : %s secondes

source: Download Snapshot
fr_fr: Télécharger l'instantané

source: Delete Snapshot
fr_fr: Supprimer l'instantané

source: Last changes
fr_fr: Dernières modifications

source: New files: %s
fr_fr: Nouveaux fichiers : %s

source: Deleted files: %s
fr_fr: Fichiers supprimés : %s

source: Modified files: %s
fr_fr: Fichiers modifiés : %s

source: View Changes
fr_fr: Voir les Modifications

source: Download Changes
fr_fr: Télécharger les Modifications

source: Click a file to get more info about it.
fr_fr: Cliquez sur un fichier pour obtenir plus d'info.

source: New files:
fr_fr: Nouveaux fichiers :

source: Size
fr_fr: Taille

source: Access
fr_fr: Accès

source: Modify (mtime)
fr_fr: Modification (mtime)

source: Change (ctime)
fr_fr: Changement (ctime)

source: Deleted files:
fr_fr: Fichiers supprimés :

source: Modified files:
fr_fr: Fichiers modifiés :

source: Old
fr_fr: Ancien

source: New
fr_fr: Nouveau

source: None
fr_fr: Aucune

source: Scan System For File Changes
fr_fr: Lancer l'analyse des fichiers

source: Enter the full path to the directory to be scanned.
fr_fr: Entrez le chemin complet vers le répertoire à scanner.

source: The directory "%s" does not exist.
fr_fr: Le répertoire "%s" n'existe pas.

source: Cannot open "%s" directory
fr_fr: Le répertoire "%s" n'est pas lisible

source: Missing options line %s, please try again.
fr_fr: Option manquante (ligne %s). Veuillez essayer à nouveau.

source: Error reading old snapshot file.
fr_fr: Erreur lors de la lecture du fichier de l'ancien instantané.

source: Error reading new snapshot file.
fr_fr: Erreur lors de la lecture du fichier du nouvel instantané.

source: Enable File Guard
fr_fr: Activer File Guard

source: Real-time detection
fr_fr: Détection en temps réel

source: Full or partial case-sensitive string(s), max. 255 characters. Multiple values must be comma-separated.
fr_fr: Chaîne de caractères complète ou partielle, sensible à la casse, 255 caractères maximum. Plusieurs valeurs doivent être séparées par des virgules.

source: NinjaFirewall must be enabled and working in order to use the Live Log feature.
fr_fr: NinjaFirewall doit être activé pour que Live Log puisse fonctionner.

source: You must be whitelisted in order to use that feature. Click on "Firewall > Access Control" and ensure that the "Whitelist the Administrator" option is enabled.
fr_fr: Vous devez être dans la liste blanche afin de pouvoir utiliser Live Log. Cliquez sur le menu "Pare-Feu > Contrôle d'Accès" et assurez vous que l'option "Ajouter l'Administrateur à la liste blanche" est activée.

source: Refresh rate:
fr_fr: Intervalle :

source: 5 seconds
fr_fr: 5 secondes

source: 10 seconds
fr_fr: 10 secondes

source: 20 seconds
fr_fr: 20 secondes

source: 45 seconds
fr_fr: 45 secondes

source: Clear screen
fr_fr: Effacer

source: Autoscrolling
fr_fr: Défilement auto

source: Live Log will not show connections from the administrator.
fr_fr: Live Log n'affiche pas les connexions de l'administrateur.

source: Log format
fr_fr: Format d'affichage

source: Default
fr_fr: Défaut

source: Custom
fr_fr: Autre

source: See contextual help for available log format.
fr_fr: Consultez l'aide contextuelle pour avoir plus d'information sur les formats disponibles.

source: Display
fr_fr: Afficher

source: HTTP and HTTPS traffic (default)
fr_fr: Trafic HTTP et HTTPS (défaut)

source: HTTP traffic only
fr_fr: Trafic HTTP uniquement

source: HTTPS traffic only
fr_fr: Trafic HTTPS uniquement

source: Inclusion and exclusion filters (REQUEST_URI)
fr_fr: Filtres d'inclusion et d'exclusion (REQUEST_URI)

source: Must include
fr_fr: Doit inclure

source: Must not include
fr_fr: Ne doit pas inclure

source: e.g.,
fr_fr: par ex.

source: or
fr_fr: ou

source: Full or partial case-sensitive REQUEST_URI string. Multiple values must be comma-separated.
fr_fr: Chaîne de caractères REQUEST_URI complète ou partielle, sensible à la casse. Plusieurs valeurs doivent être séparées par des virgules.

source: Save Options
fr_fr: Sauvegarder les options

source: Please enter the custom log format.
fr_fr: Veuillez entrer le format d'affichage.

source: The current log (%s) is not writable. Please change its permission.
fr_fr: Le fichier du journal (%s) est en lecture seule. Veuillez changer ses permissions.

source: The log directory (%s) is not writable. Please change its permission.
fr_fr: Le répertoire du journal (%s) est en lecture seule. Veuillez changer ses permissions.

source: Your public key has been deleted.
fr_fr: Votre clé publique a été supprimée.

source: Your public key has been saved.
fr_fr: Votre clé publique a été sauvegardée.

source: The selected log was deleted.
fr_fr: Le journal sélectionné a été supprimé.

source: Your log has %s lines. I will display the last %s lines only.
fr_fr: Votre journal contient %s lignes. Seules les %s dernières vont être affichées.

source: Viewing:
fr_fr: Journal :

source: bytes
fr_fr: octets

source: Export
fr_fr: Exporter

source: Delete
fr_fr: Supprimer

source: Delete log?
fr_fr: Supprimer le journal ?

source: The selected log is empty
fr_fr: Le journal sélectionné est vide

source: Today
fr_fr: Aujourd'hui

source: Critical
fr_fr: Critique

source: High
fr_fr: Elevé

source: Medium
fr_fr: Moyen

source: Uploads
fr_fr: Téléchargement

source: Debug
fr_fr: Débogage

source: Enable firewall log
fr_fr: Activer le journal

source: Auto-rotate log
fr_fr: Rotation automatique du journal

source: 1st day of the month, or if bigger than %s MB
fr_fr: Le 1er de chaque mois, ou si sa taille dépasse %s Mo

source: (default)
fr_fr: (défaut)

source: 1st day of the month, regardless of its size
fr_fr: Le 1er de chaque mois, quelle que soit sa taille

source: Show the most recent
fr_fr: Afficher les dernières

source: %s lines
fr_fr: %s lignes

source: Your server configuration is not compatible with this option.
fr_fr: La configuration de votre serveur n'est pas compatible avec cette option.

source: See contextual help before enabling this option.
fr_fr: Consultez l'aide contextuelle avant d'activer cette option.

source: Enter your public key (optional)
fr_fr: Entrez votre clé publique (optionnel)

source: <a href="%s">Consult our blog</a> if you want to enable centralized logging.
fr_fr: Veuillez <a href="%s">consulter notre blog</a> afin d'activer la Centralisation des Logs.

source: Save Public Key
fr_fr: Sauvegarder la Clé Publique

source: Delete Public Key
fr_fr: Supprimer la Clé Publique

source: Unable to delete the log
fr_fr: Impossible de supprimer le journal

source: Error
fr_fr: Erreur

source: You do not have any log for the current month yet.
fr_fr: Vous n'avez pas encore de journal pour le mois en cours.

source: Cannot open the log for read operation.
fr_fr: Impossible d'ouvrir le journal en lecture.

source: The selected log is empty.
fr_fr: Le journal sélectionné est vide.

source: The URL is invalid.
fr_fr: L'adresse URL ne semble pas valide.

source: Unable to connect to the remote website: %s.
fr_fr: Impossible de se connecter au site distant : %s.

source: The remote server rejected your request. Make sure that you uploaded the correct public key.
fr_fr: Le serveur distant a rejeté votre requête. Veuillez vous assurer que la clé publique est correcte.

source: The remote server returned the following HTTP error: %s.
fr_fr: Le serveur HTTP a retourné le code d'erreur suivant : %s.

source: The remote server returned a redirection code: %s.
fr_fr: Le site distant a retourné un code de redirection : %s.

source: The requested log does not exist on the remote website.
fr_fr: Le journal demandé n'existe pas sur le site distant.

source: Unable to open the log for read operation.
fr_fr: Impossible d'ouvrir le journal en lecture.

source: The remote website did not return the expected response.
fr_fr: Le site distant n'a pas retourné la réponse attendue.

source: Firewall protection
fr_fr: Pare-feu

source: Debug mode
fr_fr: Mode débogage

source: HTTP error code to return
fr_fr: Code HTTP à retourner

source: 403 Forbidden (default)
fr_fr: 403 Forbidden (défaut)

source: Anonymize IP addresses
fr_fr: Anonymiser les adresses IP

source: Anonymize IP addresses by removing the last 3 characters. This option does not apply to private IP addresses.
fr_fr: Anonymise les adresses IP dans le journal du pare-feu en supprimant leurs 3 derniers caractères. Elle ne s'applique pas aux adresses IP privées.

source: Blocked user message
fr_fr: Message pour les utilisateurs bloqués

source: Preview message
fr_fr: Prévisualiser

source: Default message
fr_fr: Message par défaut

source: Banned IP addresses
fr_fr: Adresses IP bloquées

source: Ban offending IP addresses
fr_fr: Bannir les adresses IP incriminées

source: Never ban IPs
fr_fr: Ne jamais bannir

source: Only if critical severity
fr_fr: Si risque critique uniquement

source: If critical or high severity
fr_fr: Si risque critique ou élevé

source: Always ban offending IPs
fr_fr: Toujours bannir

source: Banning period (from 1 to 9999 minutes)
fr_fr: Durée de bannissement (de 1 à 9999 minutes)

source: Currently banned IP addresses:
fr_fr: Adresses IP bloquées :

source: To unban IP addresses, select them in the list and click '%s'.
fr_fr: Sélectionnez les adresses IP à débloquer, puis cliquez '%s'.

source: Basic Policies
fr_fr: Politiques de base

source: Intermediate Policies
fr_fr: Politiques intermédiaires

source: Advanced Policies
fr_fr: Politiques avancées

source: Enable NinjaFirewall for
fr_fr: Activer NinjaFirewall pour le trafic

source: HTTP and HTTPS traffic
fr_fr: HTTP et HTTPS

source: Allow uploads
fr_fr: Autoriser

source: Disallow uploads
fr_fr: Ne pas autoriser

source: Allow, but block dangerous files
fr_fr: Autoriser, mais bloquer les fichiers dangereux

source: See contextual help for the list of blocked files.
fr_fr: Consultez l'aide contextuelle pour voir la liste des fichiers concernés.

source: Sanitise filenames
fr_fr: Nettoyer le nom des fichiers

source: substitution character:
fr_fr: caractère de substitution :

source: Maximum allowed file size (in KB)
fr_fr: Taille maximale autorisée (en Ko)

source: HTTP GET variable
fr_fr: Variable HTTP GET

source: Scan %s variable
fr_fr: Filtrer la variable %s

source: Sanitise %s variable
fr_fr: Nettoyer la variable %s

source: HTTP POST variable
fr_fr: Variable HTTP POST

source: Do not enable this option unless you know what you are doing!
fr_fr: N'activez pas cette option si vous n'êtes pas sûr de ce que vous faites !

source: Decode base64-encoded POST variable
fr_fr: Décoder les chaîne encodées en base64 dans la variable POST

source: HTTP REQUEST variable
fr_fr: Variable HTTP REQUEST

source: HTTP_USER_AGENT server variable
fr_fr: Variable HTTP_USER_AGENT

source: Block POST requests from User-Agents that do not have
fr_fr: Bloquer les requêtes POST des navigateurs qui n'ont pas

source: A Mozilla-compatible signature
fr_fr: Une signature compatible Mozilla

source: A HTTP_ACCEPT header
fr_fr: Un en-tête HTTP_ACCEPT

source: A HTTP_ACCEPT_LANGUAGE header
fr_fr: Un en-tête HTTP_ACCEPT_LANGUAGE

source: Keep these 3 options disabled if you are using scripts like Paypal IPN (unless you added them to your IP or URL Access Control whitelist).
fr_fr: N'activez pas ces options si vous utilisez des scripts comme Paypal IPN (sauf si vous avez ajouté leur IP ou URL dans le menu Contrôle d'Accès).

source: Block suspicious bots/scanners
fr_fr: Bloquer les requêtes provenant de bots/scanners suspects

source: HTTP_REFERER server variable
fr_fr: Variable HTTP_REFERER

source: Block POST requests that do not have an HTTP_REFERER header
fr_fr: Bloquer les requêtes POST qui n'ont pas d'en-tête HTTP_REFERER

source: Keep this option disabled if you are using scripts like Paypal IPN (unless you added them to your IP or URL Access Control whitelist).
fr_fr: N'activez pas ces options si vous utilisez des scripts comme Paypal IPN (sauf si vous avez ajouté leur IP ou URL dans le menu Contrôle d'Accès).

source: This option is disabled because the %s PHP function is not available on your server.
fr_fr: Cette option est désactivée parce que la fonction PHP %s n'est pas disponible sur votre serveur.

source: HTTP response headers
fr_fr: En-têtes de réponse HTTP

source: Set X-Content-Type-Options to protect against MIME type confusion attacks
fr_fr: Activer X-Content-Type-Options pour protéger contre les attaques basées sur la confusion du type MIME

source: Set X-Frame-Options to protect against clickjacking attempts
fr_fr: Activer X-Frame-Options pour protéger contre les attaques de détournement de clic (clickjacking)

source: Set X-XSS-Protection (IE/Edge, Chrome, Opera and Safari browsers)
fr_fr: Activer X-XSS-Protection (IE/Edge, Opera, Chrome et Safari)

source: Set to %s
fr_fr: Régler sur %s
