Repository: skimasax/prochatr
Catalog: public/ninja/locale/*/LC_MESSAGES/ninjafirewall_pro-*.po
Languages: fr_fr

source: The admin log is empty.
fr_fr: Le fichier journal est vide.

source: Unable to open logfile: %s
fr_fr: Impossible d'ouvrir le fichier journal : %s

source: Summary > Overview
fr_fr: Sommaire > Aperçu

source: Summary > Statistics
fr_fr: Sommaire > Statistiques

source: Account > Options
fr_fr: Compte > Options

source: Account > License
fr_fr: Compte > Licence

source: Account > Updates
fr_fr: Compte > Mises à jour

source: Firewall > Options
fr_fr: Pare-Feu > Options

source: Firewall > Policies
fr_fr: Pare-Feu > Politiques

source: Firewall > Access Control
fr_fr: Pare-Feu > Contrôle d'Accès

source: Firewall > Rules Editor
fr_fr: Pare-Feu > Éditeur de Règles

source: Logs > Firewall Log
fr_fr: Journaux > Journal du pare-feu

source: Logs > Live Log
fr_fr: Journaux > Live Log

source: Logs > Centralized Logging
fr_fr: Journaux > Centralisation des Logs

source: Summary
fr_fr: Sommaire

source: Overview
fr_fr: Aperçu

source: Statistics
fr_fr: Statistiques

source: Account
fr_fr: Compte

source: License
fr_fr: Licence

source: Updates
fr_fr: Mises à jour

source: Firewall
fr_fr: Pare-Feu

source: Policies
fr_fr: Politiques

source: Access Control
fr_fr: Contrôle d'Accès

source: Rules Editor
fr_fr: Éditeur de Règles

source: Logs
fr_fr: Journaux

source: Firewall Log
fr_fr: Journal du pare-feu

source: Centralized Logging
fr_fr: Centralisation des Logs

source: Help
fr_fr: Aide

source: Logout
fr_fr: Déconnexion

source: Close
fr_fr: Fermer

source: Updates info:
fr_fr: Info mise à jour :

source: GDPR Compliance
fr_fr: Conformité RGPD

source: security rules: %s
fr_fr: règles de sécurité : %s

source: You already have a %s file. If you want to re-install NinjaFirewall, delete it first.
fr_fr: Vous avez déjà un fichier %s. Si vous voulez réinstaller NinjaFirewall, supprimez ce fichier.

source: Missing %s file. Please re-install NinjaFirewall.
fr_fr: Le fichier %s est manquant. Veuillez réinstaller NinjaFirewall.

source: Welcome to NinjaFirewall %s installation!
fr_fr: Bienvenue dans l'assistant d'installation de NinjaFirewall %s !

source: Regional Settings
fr_fr: Paramètres Régionaux

source: Select a display language
fr_fr: Sélectionnez une langue d'affichage

source: Display dates and times using the following timezone
fr_fr: Afficher les dates et heures en utilisant le fuseau horaire suivant

source: Next
fr_fr: Suivant

source: System requirements
fr_fr: Configuration requise

source: PHP version
fr_fr: Version PHP

source: NinjaFirewall requires PHP v5.3 or greater, but your current version is %s.
fr_fr: NinjaFirewall nécessite au minimum PHP v5.3, but votre version actuelle est %s.

source: Operating system
fr_fr: Système d'exploitation

source: NinjaFirewall is not compatible with Microsoft Windows.
fr_fr: NinjaFirewall n'est pas compatible avec Microsoft Windows.

source: You have "safe_mode" enabled, please disable it. This feature has been DEPRECATED as of PHP 5.3 and REMOVED as of PHP 5.4.
fr_fr: Vous avez "safe_mode" activé, veuillez le désactiver. Cette fonctionnalité est devenue OBSOLÈTE depuis PHP 5.3 et a été SUPPRIMÉE depuis PHP 5.4.

source: Disabled
fr_fr: Désactivé

source: "auto_prepend_file" is already in use: %s<br />Because NinjaFirewall needs to use this directive, it will override it.
fr_fr: "auto_prepend_file" est déjà utilisée : %s.<br />NinjaFirewall a besoin de cette directive interne et va tenter de l'outrepasser.

source: Unused
fr_fr: Inutilisé

source: You have "magic_quotes_gpc" enabled, please disable it, this feature has been DEPRECATED as of PHP 5.3 and REMOVED as of PHP 5.4.
fr_fr: Vous avez "magic_quotes_gpc" activé, veuillez le désactiver. Cette fonctionnalité est devenue OBSOLÈTE depuis PHP 5.3 et a été SUPPRIMÉE depuis PHP 5.4.

source: Your PHP configuration does not have "cURL" support. Please install it.
fr_fr: Votre configuration PHP ne dispose pas de "cURL". Veuillez l'installer.

source: Installed
fr_fr: Installé

source: Your PHP configuration does not have the "ZipArchive" class. You can still install NinjaFirewall, but you will not be able to use one-click updates.
fr_fr: Votre configuration PHP ne dispose pas de la classe "ZipArchive". Vous pouvez tout de même installer NinjaFirewall, mais vous ne pourrez pas installer les mises à jour depuis l'interface d'administration.

source: Configuration folder
fr_fr: Répertoire de la configuration

source: The %s folder is not writable. Please change its permissions.
fr_fr: Le répertoire %s est en lecture seule. Veuillez changer ses permissions afin qu'il soit accessible en écriture.

source: The %s folder is writable
fr_fr: Le répertoire %s est accessible en écriture

source: Log folder
fr_fr: Répertoire des journaux

source: NinjaFirewall installation cannot proceed. Please change your system settings to match the requirements.
fr_fr: L'installation de NinjaFirewall ne peut pas continuer. Veuillez résoudre les problèmes mentionnés ci-dessus.

source: Cannot find the %s file. Make sure your version of NinjaFirewall is not corrupted, or download it again from nintechnet.com website. Installation aborted.
fr_fr: Impossible de trouver le fichier %s. Assurez-vous que votre version de NinjaFirewall n'est pas corrompue, ou téléchargez-le à nouveau sur le site de nintechnet.com. L'installation ne peut pas continuer.

source: Release Notes
fr_fr: Notes de version

source: Please enter the administrator name.
fr_fr: Veuillez entrer le nom de compte de l'administrateur.

source: The administrator name can only contain from 6 to 20 alpha-numeric characters and underscore (_).
fr_fr: 'Le nom de compte de l'administrateur doit contenir entre 6 et 20 caractères alpha-numériques ainsi que le caractère (_).

source: Please enter the administrator password.
fr_fr: Veuillez entrer le mot de passe de l'administrateur.

source: The administrator password must contain at least 8 characters.
fr_fr: Le mot de passe de l'administrateur doit contenir au moins 8 caractères.

source: Please retype the administrator password.
fr_fr: Veuillez retaper le mot de passe de l'administrateur.

source: The administrator password must be the same in both fields.
fr_fr: Le mot de passe de l'administrateur doit être le même dans les deux champs.

source: Please enter a valid administrator email address.
fr_fr: Veuillez entrer une adresse e-mail valide pour l'administrateur.

source: Please enter your NinjaFirewall Pro+ license key.
fr_fr: Veuillez entrer la clé votre licence NinjaFirewall Pro+.

source: Administrator
fr_fr: Administrateur

source: Administrator name (6 to 20 characters)
fr_fr: Nom du compte de l'administrateur (6 à 20 caractères)

source: Administrator password (at least 8 characters)
fr_fr: Mot de passe de l'administrateur (8 caractères minimum)

source: Retype administrator password
fr_fr: Retaper le mot de passe administrateur

source: Administrator email
fr_fr: Adresse e-mail de l'administrateur

source: Enter your NinjaFirewall Pro+ license key
fr_fr: Entrez la clé de votre licence NinjaFirewall Pro+

source: Unable to connect to NinjaFirewall server to check the license.
fr_fr: Impossible de se connecter au serveur de NinjaFirewall pour vérifier la licence.

source: Unable to connect to NinjaFirewall server: HTTP error.
fr_fr: Impossible de se connecter au serveur de NinjaFirewall: erreur HTTP.

source: Unable to connect to NinjaFirewall server: no response or empty response.
fr_fr: Impossible de se connecter au serveur de NinjaFirewall: aucune réponse ou réponse vide.

source: Unable to connect to NinjaFirewall server: unexpected response.
fr_fr: Impossible de se connecter au serveur de NinjaFirewall: les données retournées ne correspondent pas à celles attendues.

source: Your license is not valid (#%s).
fr_fr: Votre licence n'est pas valide (#%s).

source: Unable to connect to NinjaFirewall server: unknown error.
fr_fr: Impossible de se connecter au serveur de NinjaFirewall: erreur inattendue.

source: (recommended)
fr_fr: (recommendé)

source: Please enter the directory to be protected by NinjaFirewall.
fr_fr: Veuillez entrer le répertoire qui sera protégé par NinjaFirewall.

source: Please select the PHP initialization file supported by your server.
fr_fr: Veuillez sélectionner le type de fichier de configuration PHP utilisé par votre serveur.

source: Integration
fr_fr: Intégration

source: Enter the directory to be protected by NinjaFirewall. By default, it is <code>%s</code>
fr_fr: Entrez le répertoire qui sera protégé par NinjaFirewall. Par défaut, il s'agit de <code>%s</code>

source: Select your HTTP server and PHP SAPI
fr_fr: Sélectionnez votre serveur HTTP et PHP SAPI

source: CGI or PHP-FPM
fr_fr: CGI ou PHP-FPM

source: Other webserver
fr_fr: Autre serveur HTTP

source: Click to view your server PHP configuration
fr_fr: Cliquez pour afficher votre configuration PHP

source: View PHPINFO
fr_fr: Voir PHPINFO

source: Please check our blog if you want to install NinjaFirewall on HHVM.
fr_fr: Veuillez consulter notre blog afin d'installer NinjaFirewall avec HHVM.

source: Select the PHP initialization file supported by your server
fr_fr: Sélectionnez le type de fichier de configuration PHP utilisé par votre serveur

source: Used by most shared hosting accounts
fr_fr: Utilisé par la plupart des hébergements mutualisés

source: Used by most dedicated/VPS servers, as well as shared hosting accounts that do not support php.ini
fr_fr: Utilisé par la plupart des serveurs dédiés et VPS, ainsi que de nombreux hébergements mutualisés n'utilisant pas les fichiers php.ini

source: more info
fr_fr: plus d'info

source: A few shared hosting accounts. Seldom used
fr_fr: Quelques hébergements mutualisés. Rarement utilisé'

source: The directory to protect must include NinjaFirewall installation folder.
fr_fr: Le répertoire à protéger doit inclure le répertoire où est installé NinjaFirewall.

source: Error #%s
fr_fr: Erreur #%s

source: In order to protect your site, NinjaFirewall needs some specific directives to be added to your <code>%s</code> file.
fr_fr: Afin de protéger votre site, NinjaFirewall nécessite l'ajout d'instructions spécifiques au fichier <code>%s</code>.

source: Please add the following <font color="red">red lines</font> of code to your <code>%s</code> file. All other lines, if any, are the actual content of the file and should not be changed:
fr_fr: Veuillez ajouter les <font color="red">lignes rouges</font> suivantes au fichier <code>%s</code>. Toutes les autres lignes, le cas échéant, sont le contenu actuel du fichier et ne doivent pas être modifiées :

source: Please create a <code>%s</code> file, and add the following lines of code to it:
fr_fr: Veuillez créer le fichier <code>%s</code>, et y ajouter les lignes suivantes :

source: In order to protect your site, NinjaFirewall needs some specific directives to be added to your <code>%s</code> and <code>%s</code> files.
fr_fr: Afin de protéger votre site, NinjaFirewall nécessite l'ajout d'instructions spécifiques aux fichiers <code>%s</code> et <code>%s</code>.

source: Add the following code to your <code>/etc/hhvm/php.ini</code> file, and restart HHVM afterwards:
fr_fr: Ajoutez le code suivant à votre fichier <code>/etc/hhvm/php.ini</code>, puis redémarrez HHVM :

source: After making those changes, please click on the button below to test NinjaFirewall.
fr_fr: Après avoir effectué ces changements, veuillez cliquer sur le bouton ci-dessous pour tester NinjaFirewall.

source: Test NinjaFirewall
fr_fr: Tester NinjaFirewall

source: Failed!
fr_fr: Echec !

source: The firewall is not loaded.
fr_fr: Le pare-feu n'est pas activé.

source: You selected <code>Apache + PHP5 module</code> as your HTTP server and PHP SAPI. Maybe your HTTP server is <code>Apache + CGI/FastCGI</code>?
fr_fr: Vous avez sélectionné <code>Apache + module PHP5</code> comme serveur HTTP et PHP SAPI. Peut-être devriez-vous plutôt choisir <code>Apache + CGI/FastCGI</code> ?

source: You can go back and try to select another HTTP server type
fr_fr: Vous pouvez revenir en arrière et essayer de modifier votre sélection

source: You have selected <code>.user.ini</code> as your PHP initialization file. Unlike <code>php.ini</code>, <code>.user.ini</code> files are not reloaded immediately by PHP, but every 5 minutes. If this is your own server, restart Apache (or PHP-FPM if you are running nginx) to force PHP to reload it, otherwise please wait a few minutes and then, click the button below to run the firewall test again.
fr_fr: Vous avez sélectionné <code>.user.ini</code> comme fichier de configuration PHP. Contrairement au fichier <code>php.ini</code>, les changement effectués dans un fichier <code>.user.ini</code> ne sont pas pris en compte immédiatement par PHP, mais environ toutes les 5 minutes. S'il s'agit de votre propre serveur, vous pouvez redémarrer Apache (ou PHP-FPM si vous utilisez Nginx) pour forcer PHP a le recharger immédiatement, sinon veuillez patienter quelques minutes avant de cliquer sur le bouton ci-dessous pour relancer le test.

source: You selected <code>Apache + CGI/FastCGI</code> as your HTTP server &amp; PHP SAPI. Maybe your HTTP server is <code>Apache + PHP5 module</code>?
fr_fr: Vous avez sélectionné <code>Apache + CGI/FastCGI</code> comme serveur HTTP et PHP SAPI. Peut-être devriez-vous plutôt choisir <code>Apache + module PHP5</code> ?

source: You may have selected the wrong PHP initialization file.
fr_fr: Vous avez peut-être sélectionné un mauvais type de fichier de configuration PHP.

source: You can go back and try to select another INI file
fr_fr: Vous pouvez revenir en arrière et essayer de choisir un autre type de fichier INI

source: Need help? Check our blog:
fr_fr: Besoin d'aide ? Consultez notre blog :

source: Test again
fr_fr: Ré-essayer

source: Error!
fr_fr: Erreur !

source: NinjaFirewall is loaded but returned the following error:
fr_fr: NinjaFirewall est bien chargé, mais il a retourné une erreur :

source: You may need to restart the installer to fix that error.
fr_fr: Veuillez relancer l'installation.

source: It works!
fr_fr: OK !

source: Congratulations, NinjaFirewall is up and running.
fr_fr: Félicitations, NinjaFirewall est installé et fonctionnel.

source: Click the button below to be redirected to the administration console.
fr_fr: Cliquez sur le bouton ci-dessous afin de finaliser l'installation.

source: Quick Start, FAQ & Troubleshooting Guide
fr_fr: Guide d'Utilisation, Installation et Dépannage

source: Hi,
fr_fr: Bonjour,

source: This is NinjaFirewall's installer. Below are some helpful info and links you may consider reading before using NinjaFirewall.
fr_fr: Je suis l'installateur de NinjaFirewall. Voici quelques informations et liens qui pourraient vous être utiles (en langue anglaise).

source: FAQ & Troubleshooting:
fr_fr: FAQ et Dépannage :

source: NinjaFirewall (Pro/Pro+ Edition) troubleshooter script:
fr_fr: Script de dépannage (Pro/Pro+ Edition) :

source: -Rename this file to "pro-check.php".
fr_fr: -Renommez ce fichier en "pro-check.php".

source: -Upload it into yourwebsite root folder.
fr_fr: -Téléchargez-le dans le répertoire racine de votre site.

source: -Goto http://YOUR WEBSITE/pro-check.php.
fr_fr: -Rendez-vous sur http://VOTRE-SITE/pro-check.php.

source: -Delete it afterwards.
fr_fr: -Supprimez-le lorsque vous avez fini.

source: Must Read:
fr_fr: A lire aussi :

source: -An introduction to NinjaFirewall filtering engine:
fr_fr: -Présentation du moteur de filtrage de NinjaFirewall :

source: -Testing NinjaFirewall without blocking your visitors:
fr_fr: -Tester NinjaFirewall sans bloquer vos visiteurs :

source: -Add your own code to the firewall: the ".htninja" file:
fr_fr: -Ajoutez votre code au pare-feu: le fichier ".htninja" :

source: -Upgrading to PHP 7 with NinjaFirewall installed:
fr_fr: -Mise à niveau de PHP 5 vers PHP 7 avec NinjaFirewall installé :

source: -Securing a Joomla! installation with NinjaFirewall:
fr_fr: -Sécuriser une installation Joomla! avec NinjaFirewall :

source: -Test your website security with our online scanner:
fr_fr: - Testez la sécurité de votre site avec notre scanner en ligne :

source: Help & Support Links:
fr_fr: Aide & Support :

source: -Each page of NinjaFirewall includes a contextual help: click on the "Help" menu tab located in the upper right corner of the corresponding page.
fr_fr: -Si vous avez besoin d'aide, cliquez sur l'onglet "Aide" situé dans le coin supérieur droit de chaque page.

source: -Updates info are available via Twitter:
fr_fr: -Les info de mise à jour sont disponibles via Twitter :

source: -Help Desk (Premium users only):
fr_fr: -Help Desk (utilisateurs Premium uniquement) :

source: You do not have any license.
fr_fr: Vous n'avez pas de licence valide.

source: You have a valid license.
fr_fr: Votre licence est valide.

source: Your license is not valid.
fr_fr: Votre licence n'est pas valide.

source: An unknown error occured while connecting to NinjaFirewall servers. Please try again in a few minutes.
fr_fr: Une erreur inattendue s'est produite lors de la connexion au serveur de NinjaFirewall. Merci d'essayer à nouveau dans quelques minutes.

source: Enter your new license and click on the save button
fr_fr: Entrez votre nouvelle licence

source: This is already your current license.
fr_fr: Ce numéro est celui de votre licence actuelle.

source: Your new license has been accepted and saved.
fr_fr: Votre nouvelle licence a été acceptée et sauvegardée.

source: Current License
fr_fr: Licence Actuelle

source: Expiration date
fr_fr: Date d'expiration

source: Unknown expiration date. Use the "%s" button to attempt to fix this error.
fr_fr: Date d'expiration inconnue. Cliquez sur le bouton "%s" pour essayer de corriger ce problème.

source: Check License Validity
fr_fr: Vérifier la licence

source: Your license will expire soon.
fr_fr: Votre licence va bientôt expirer.

source: Your license has expired.
fr_fr: Votre licence a expiré.

source: License Number
fr_fr: Numéro de licence

source: License renewal
fr_fr: Renouvellement

source: Click here to get a license
fr_fr: Cliquez ici pour obtenir une licence

source: Save New License
fr_fr: Sauvegarder le nouvelle licence

source: Connections to NinjaFirewall server have been disabled by the user.
fr_fr: Les connexions au serveur de NinjaFirewall ont été désactivées par l'utilisateur.

source: Unable to connect to NinjaFirewall server (%s).
fr_fr: Impossible de se connecter au serveur de NinjaFirewall (%s).

source: The server returned the following HTTP code: %s %s
fr_fr: Le serveur a retourné le code d'erreur HTTP suivant : %s %s

source: The remote server did not return any data.
fr_fr: Le serveur distant n'a pas retourné de réponse.

source: The remote server did not return the expected data.
fr_fr: Le serveur distant n'a pas retourné la réponse attendue.

source: Your changes were saved.
fr_fr: Vos modifications ont été enregistrées.

source: Login password
fr_fr: Mot De Passe

source: Password length must be at least 8 characters
fr_fr: Le mot de passe doit contenir au moins 8 caractères

source: Old password
fr_fr: Ancien mot de passe

source: New password
fr_fr: Nouveau mot de passe

source: Verify new password
fr_fr: Retaper le mot de passe

source: Enter your email address where NinjaFirewall will send you alerts and notifications
fr_fr: Entrez l'adresse e-mail où seront envoyées les alertes et notifications de NinjaFirewall

source: Email address
fr_fr: Adresse e-mail

source: from
fr_fr: de

source: If you want to add your own language file, <a href="%s">consult this article</a>.
fr_fr: Si vous voulez ajouter votre propre fichier de langue, <a href="%s">consultez cet article</a>.

source: Appearance
fr_fr: Apparence

source: Loaded style sheets
fr_fr: Feuilles de style chargées

source: user style sheet (%s)
fr_fr: feuille de style de l'utilisateur (%s)

source: If you want to customize NinjaFirewall UI and load your own style sheet, <a href="%s">consult this article</a>.
fr_fr: Si vous souhaitez personnaliser l'interface utilisateur de NinjaFirewall et charger votre propre feuille de style, <a href="%s">consultez cet article</a>.

source: Fonts
fr_fr: Polices

source: Default fonts
fr_fr: Polices par défaut

source: Multiple values must be comma separated (e.g. <code>"Open Sans",Verdana,sans-serif</code>). Leave empty if you want to use the default fonts defined in the CSS style sheet.
fr_fr: Les valeurs multiples doivent être séparées par des virgules (par exemple, <code>"Open Sans", Verdana, sans-serif</code>). Laissez vide si vous souhaitez utiliser les polices par défaut.

source: Login
fr_fr: Connexion

source: Send me an email whenever someone logs in to my NinjaFirewall admin account
fr_fr: Envoyez-moi un e-mail chaque fois que quelqu'un se connecte à mon compte NinjaFirewall

source: Yes
fr_fr: Oui

source: No
fr_fr: Non

source: Always log in using a secure connection (HTTPS)
fr_fr: Forcer la connexion sécurisée (HTTPS) lors de l'accès à mon compte

source: Automatically check for updates when I log in
fr_fr: Vérifier automatiquement les mises à jour lorsque je me connecte

source: Save changes
fr_fr: Sauvegarder les modifications

source: If you want to change your login password, please enter the current one and twice your new password. Otherwise, leave those fields blank.
fr_fr: Si vous souhaitez modifier votre mot de passe, entrez l'actuel mot de passe et le nouveau deux fois. Sinon, laissez les champs vides.

source: The new password must be the same in both fields.
fr_fr: Le nouveau mot de passe doit être identique dans les deux champs.

source: The old password is not correct.
fr_fr: L'ancien mot de passe est invalide.

source: The new password must contain at least 8 characters.
fr_fr: Le nouveau mot de passe doit contenir au moins 8 caractères.

source: Please enter a valid email address.
fr_fr: Vous devez entrer une adresse e-mail valide.

source: NinjaFirewall cannot check for updates because your PHP configuration does not have cURL support.
fr_fr: Impossible de vérifier les mises à jour car votre configuration PHP ne dispose pas de cURL.

source: The "%s" directory is not writable. Operation aborted.
fr_fr: Impossible d'effectuer la mise à jour car le répertoire "%s" est en lecture seule.

source: Unable to download or save the update.
fr_fr: Impossible de télécharger ou de sauvegarder la mise à jour.

source: Unable to retrieve the downloaded file version. Operation aborted.
fr_fr: Impossible de récupérer la version de la mise à jour téléchargée.

source: Your current version is %s and downloaded version is %s too.
fr_fr: Votre version actuelle %s et la version téléchargée %s sont identiques.

source: The downloaded update does not match your NinjaFirewall edition. Update is not possible.
fr_fr: La mise à jour téléchargée ne correspond pas à votre édition de NinjaFirewall. La mise à jour est impossible.

source: You are about to update from version %s to %s.
fr_fr: Vous êtes sur le point de mettre à jour votre version %s vers la version %s.

source: Please review the changelog below and click the button to proceed.
fr_fr: Consultez les nouveautés ci-dessous puis cliquez sur le bouton pour lancer le processus.

source: Install this update
fr_fr: Installer cette mise à jour

source: NinjaFirewall cannot extract the update because your PHP configuration does not have the ZipArchive class.
fr_fr: Impossible d'extraire les fichiers car votre configuration PHP ne dispose pas de la classe ZipArchive.

source: The update was successful.
fr_fr: La mise à jour est terminée.

source: Click here to finalize
fr_fr: Cliquez ici pour finaliser

source: Your version is up to date.
fr_fr: Votre version est à jour.

source: A new version is available: v%s
fr_fr: Une nouvelle version est disponible : v%s
