Repository: skimasax/prochatr
Catalog: public/ninja/locale/*/LC_MESSAGES/ninjafirewall_pro-*.po
Languages: fr_fr

source: Username:
fr_fr: Utilisateur :

source: Password:
fr_fr: Mot de passe :
