Repository: skimasax/prochatr
Catalog: public/ninja/locale/*/LC_MESSAGES/ninjafirewall_pro-*.po
Languages: fr_fr

source: If your PHP scripts send cookies that need to be accessed from JavaScript, you should keep that option disabled.
fr_fr: Si vos scripts PHP envoient des cookies qui doivent être accessibles à partir de JavaScript, vous devez garder cette option désactivée.

source: This policy enforces secure HTTPS connections to the server. Web browsers will not allow the user to access the web application over insecure HTTP protocol. It helps to defend against cookie hijacking and Man-in-the-middle attacks. Most recent browsers support HSTS headers.
fr_fr: Cette politique force les connexions HTTPS sécurisées vers le serveur. Les navigateurs n'accepteront pas de se connecter au site si la connexion n'est pas sécurisée (HTTPS). Cela permet de se défendre contre les détournements de cookies ou les attaques du type "Man-in-the-middle". La plupart des navigateurs récents sont compatibles avec cette politique.

source: This policy helps to mitigate threats such as XSS, phishing and clickjacking attacks. It covers JavaScript, CSS, HTML frames, web workers, fonts, images, objects (Java, ActiveX, audio and video files), and other HTML5 features.
fr_fr: Cette politique aide pour bloquer les attaques XSS notamment. Elle couvre le code JavaScript, les styles CSS, frames/iframes HTML, polices, images, objets (Java, ActiveX, fichiers audio et video), mais aussi les WebSocket.

source: Set Referrer-Policy
fr_fr: Activer Referrer-Policy

source: This HTTP header governs which referrer information, sent in the Referer header, should be included with requests made.
fr_fr: Cet en-tête HTTP détermine quelles informations de provenance doivent être incluses dans l'en-tête Referer.

source: PHP has several wrappers for use with the filesystem functions. It is possible for an attacker to use them to bypass firewalls and various IDS to exploit remote and local file inclusions. This option lets you block any script attempting to pass a <code>expect://</code>, <code>file://</code>, <code>phar://</code>, <code>php://</code>, <code>zip://</code> or <code>data://</code> stream inside a <code>GET</code> or <code>POST</code> request, cookies, user agent and referrer variables.
fr_fr: PHP dispose de nombreux gestionnaires pour différents types de protocoles de style URL, à utiliser avec les fonctions de manipulation de fichiers. Il est possible pour un hackeur de les utiliser afin de passer outre un pare-feu ou plugin de sécurité afin d'exploiter une vulnérabilité dans un script (RFI/LFI etc). Cette option détecte et bloque toute tentative d'utilisation de <code>expect://</code>, <code>file://</code>, <code>phar://</code>, <code>php://</code>, <code>zip://</code> ou <code>data://</code> dans une requête <code>GET</code> ou <code>POST</code>, des cookies, ou dans les variables <code>HTTP_REFERER</code> et <code>HTTP_USER_AGENT</code>.

source: Object Serialization is a PHP feature used by many applications to generate a storable representation of a value. However, some insecure PHP applications and plugins can turn that feature into a critical vulnerability called PHP Object Injection. This option can block serialized PHP objects found inside a <code>GET</code> or <code>POST</code> request, cookies, user agent and referrer variables.
fr_fr: La sérialisation est utilisée par de nombreuses applications afin de générer une représentation stockable d'une valeur. Cependant, lorsqu'elle est utilisée dans des applications, thèmes ou extensions mal sécurisées, la sérialisation d'objets peut être exploitée pour injecter et exécuter du code PHP (PHP Object Injection). NinjaFirewall peut bloquer les objets PHP sérialisés se trouvant dans les requêtes <code>GET</code> ou <code>POST</code>, des cookies, ou dans les variables <code>HTTP_REFERER</code> et <code>HTTP_USER_AGENT</code>.

source: This option lets you hide errors returned by your scripts. Such errors can leak sensitive informations which can be exploited by hackers.
fr_fr: Vous permet de masquer les erreurs retournées par PHP. Ces erreurs peuvent afficher des informations sensibles qui peuvent être exploitées ultérieurement par des pirates.

source: Sanitise PHP_SELF, PATH_TRANSLATED, PATH_INFO
fr_fr: Nettoyer PHP_SELF, PATH_TRANSLATED, PATH_INFO

source: This option can sanitise any dangerous characters found in those 3 server variables to prevent various XSS and database injection attempts.
fr_fr: Activez ces options si vous souhaitez que le pare-feu nettoie ces trois variables.

source: This option will block scripts attempting to pass the <code>DOCUMENT_ROOT</code> server variable in a <code>GET</code> or <code>POST</code> request. Hackers use shell scripts that often need to pass this value, but most legitimate programs do not.
fr_fr: Cette option bloque toute tentative de passer la variable <code>DOCUMENT_ROOT</code> dans une requête <code>GET</code> ou <code>POST</code>. Les pirates utilisent souvent des scripts qui nécessitent d'utiliser cette variable, mais pas la plupart des applications légitimes (hormis certains scripts d'installation ou de configuration).

source: This option will reject any <code>GET</code> or <code>POST</code> request, <code>HTTP_USER_AGENT</code>, <code>REQUEST_URI</code>, <code>PHP_SELF</code>, <code>PATH_INFO</code>, <code>HTTP_REFERER</code> variables containing the ASCII character 0x00 (NULL byte). Such a character is dangerous and should always be rejected.
fr_fr: Toute requête <code>GET</code> ou <code>POST</code>, ainsi que toute variable <code>HTTP_USER_AGENT</code>, <code>REQUEST_URI</code>, <code>PHP_SELF</code>, <code>PATH_INFO</code>, <code>HTTP_REFERER</code> contenant le caractère ASCI 0x00 (NULL byte) sera bloquée immédiatement. Ce caractère est dangereux et devrait toujours être rejeté.

source: This option will reject any <code>GET</code> or <code>POST</code> request, <code>HTTP_USER_AGENT</code>, <code>HTTP_REFERER</code> variables containing ASCII characters from 1 to 8 and 14 to 31.
fr_fr: Toute requête <code>GET</code> ou <code>POST</code>, ainsi que toute variable <code>HTTP_USER_AGENT</code>, <code>HTTP_REFERER</code> contenant des caractères ASCII 1 à 8 et 14 à 31 sera bloquée.

source: This option will block any <code>GET</code> or <code>POST</code> request containing the localhost IP. It can be useful to block SQL dumpers and various hackers shell scripts.
fr_fr: Cette option bloque toute requête <code>GET</code> ou <code>POST</code> contenant l'IP localhost (127.0.0.1). Cela peut s'avérer utile pour bloquer les programmes malveillants. Attention toutefois à ne pas bloquer certains scripts d'installation ou de configuration si vous l'activez.

source: This option will reject any request using an IP instead of a domain name in the <code>Host</code> header of the HTTP request. Unless you need to connect to your site using its IP address, (e.g. http://172.16.0.1/index.php), enabling this option will block a lot of hackers scanners because such applications scan IPs rather than domain names.
fr_fr: Cette option rejette toute requête HTTP contenant une adresse IP au lieu d'un nom de domaine dans son en-tête <code>Host</code>. Sauf si vous avez besoin de vous connecter à votre site en utilisant son adresse IP (ex: http://172.16.0.1/index.php), activer cette option bloquera de nombreux scanners de vulnérabilité car ces application trouvent les sites en scannant les plages d'adresses IP plutôt que les noms de domaine.

source: By default, NinjaFirewall will accept all HTTP methods.
fr_fr: Par défaut, NinjaFirewall accepte toutes les méthodes HTTP.

source: Access Control is a powerful set of directives that can be used to allow or restrict access to your website based on many criteria.
fr_fr: Le Contrôle d'Accès est un puissant ensemble de directives qui peut être utilisé pour autoriser ou restreindre l'accès à votre site selon de nombreux critères.

source: To make better use of them, it is important to understand NinjaFirewall's directives processing order.
fr_fr: Afin de pouvoir optimiser son utilisation, il est important de bien comprendre l'ordre dans lequel NinjaFirewall traite ces directives.

source: Because NinjaFirewall is a PHP firewall, its Access Control options apply to PHP scripts, not to static elements (e.g., images, JS, CSS etc). Depending on your configuration, they can also apply to HTML pages.
fr_fr: Parce que NinjaFirewall est un pare-feu pour PHP, les options du Contrôle d'Accès s'appliquent aux scripts PHP et non pas aux éléments statiques (images, JS, CSS, etc). Selon votre configuration, elle peuvent également s'appliquer aux pages HTML.

source: Processing order:
fr_fr: Ordre de traitement des directives :

source: Incoming HTTP request:
fr_fr: Requête HTTP entrante :

source: The <code>.htninja</code> file.
fr_fr: Fichier de configuration <code>.htninja</code>.

source: Temporarily banned IP addresses.
fr_fr: Adresses IP temporairement bannies.

source: Access Control:
fr_fr: Contrôle d'Accès :

source: Allowed IPs
fr_fr: IPs autorisées

source: Blocked IPs
fr_fr: IP bloquées

source: Allowed URLs
fr_fr: URL autorisées

source: Blocked URLs
fr_fr: URL bloquées

source: Rate Limiting
fr_fr: Limiter le trafic

source: NinjaFirewall built-in rules and policies
fr_fr: Options, Politiques et règles de pare-feu de NinjaFirewall

source: Response body:
fr_fr: Requête HTTP sortante :

source: When enabling this option, NinjaFirewall will whitelist you with a browser cookie (valid for one-year) so that you will never be blocked by the firewall. You will remain whitelisted even if you log out of the administration console.
fr_fr: En activant cette option, NinjaFirewall vous ajoutera à la liste blanche en vous donnant un cookie (valide pour un an) afin que vous ne soyez jamais bloqué par le pare-feu. Vous resterez sur la liste blanche même si vous vous déconnectez de la console d'administration.

source: This option should be used if you are behind a reverse proxy, a load balancer or using a CDN, in order to tell NinjaFirewall which IP it should use. By default, it will rely on <code>REMOTE_ADDR</code>. If you want it to use <code>HTTP_X_FORWARDED_FOR</code> or any other similar variable, it is absolutely necessary to ensure that it is reliable (i.e., setup by your own load balancer/reverse proxy) because it can be easily spoofed. If that variable includes more than one IP, only the left-most (the original client) will be checked. If it does not include any IP, NinjaFirewall will fall back to <code>REMOTE_ADDR</code>.
fr_fr: Cette option doit être utilisée si votre site est derrière un reverse proxy, un load balancer ou si vous utilisez un CDN (Cloudflare, Incapsula etc) afin d'indiquer à NinjaFirewall comment retrouver l'adresse IP de vos visiteurs. Par défaut, le pare-feu utilise <code>REMOTE_ADDR</code>. Si vous voulez utiliser <code>HTTP_X_FORWARDED_FOR</code> ou toute autre variable similaire, il est absolument nécessaire de s'assurer qu'elle est fiable (c-à-d, modifiée par votre reverse proxy/load balancer), car elle peut être facilement falsifiée. Si cette variable contient plus d'une adresse IP, seule la première insérée sera vérifiée. Si elle ne comprend aucune IP utilisable, NinjaFirewall utilisera <code>REMOTE_ADDR</code>.

source: This option will allow the firewall to scan traffic from all non-routable private IPs (IPv4 and IPv6) as well as the localhost IP. We recommend to keep it enabled if you have a private network (2 or more servers interconnected).
fr_fr: Cette option vous permet de filtrer le trafic émanant de votre réseau privé. Nous vous recommandons de le garder activé si vous avez deux ou plusieurs serveurs reliés entre eux.

source: This option lets you select the HTTP method(s). All Access Control directives (Geolocation, IPs, bots and URLs) will only apply to the selected methods. It does not apply to the Firewall Policies options, which use their own ones.
fr_fr: Vous pouvez sélectionner les méthodes HTTP. Toutes les directives du Contrôle d'Accès (Geolocalisation, IP, bots et URL) ne s'appliqueront qu'aux méthodes sélectionnées. Cette option ne concerne pas les Politiques du pare-feu.

source: Retrieve ISO 3166 code from
fr_fr: Récupérer le code ISO 3166 du pays depuis

source: This is the two-letter code that is used to define a country/territory (e.g., US, UK, FR, DE etc), based on the visitors IP. NinjaFirewall can either retrieve it from its database, or from a predefined PHP variable added by your HTTP server (e.g., <code>GEOIP_COUNTRY_CODE</code>).
fr_fr: Il s'agit du code à deux lettres qui est utilisé pour définir un pays ou territoire (par exemple, US, UK, FR, DE, etc), sur la base de l'adresse IP d'un visiteur. NinjaFirewall peut soit le récupérer à partir de sa base de données, ou à partir d'une variable PHP prédéfinie ajoutée par votre serveur HTTP (par exemple, <code>GEOIP_COUNTRY_CODE</code>).

source: You can select which country or territory you want to block. For more information about some specific ISO 3166 codes (A1, A2, AP, EU etc), you may want to consult the <a href="%s">MaxMind GeoIP online help</a>.
fr_fr: Vous pouvez sélectionner le pays ou territoire à bloquer. Pour plus d'info, vous pouvez consulter l'aide en ligne de <a href="%s">MaxMind GeoIP</a>.

source: Geolocation should apply to the whole site or specific URLs only?
fr_fr: Appliquer la Géolocalisation à tout le site ou à certains scripts uniquement ?

source: whether geolocation should apply to the every PHP scripts on your website or to specific URLs only (e.g., <code>/foobar.php</code>). Leave all fields empty if you want it to apply to the whole site.
fr_fr: S'il faut appliquer la Géolocalisation à tous les scripts PHP du site ou certains scripts uniquement (ex: <code>/foobar.php</code>). Laissez tous les champs vides pour l'appliquer à tout le site.

source: After retrieving the two-letter ISO 3166 code, NinjaFirewall can add it to the PHP headers in the <code>$_SERVER["NINJA_COUNTRY_CODE"]</code> server variable. If you have an application, theme or a plugin that needs to know your visitors location, simply use that variable.
fr_fr: NinjaFirewall peut ajouter le code à deux lettres du pays aux en-têtes PHP, dans la variable <code>$_SERVER["NINJA_COUNTRY_CODE"]</code>. Si vous avez une application PHP qui nécessite de géolocaliser vos visiteurs, activez cette option.

source: PHP code example to use in your application to geolocate your visitors:
fr_fr: Exemple de code PHP à ajouter à vos scripts pour géolocaliser vos visiteurs :

source: Your country code is:
fr_fr: Le code de votre pays est :

source: If NinjaFirewall cannot find the two-letter ISO 3166 code, it will replace it with two hyphens (<code>--</code>).
fr_fr: Si NinjaFirewall ne peut pas identifier le code à deux lettres ISO 3166, il le remplacera par deux traits d'union (<code>--</code>).

source: You can permanently allow/block an IP, a whole range of IP addresses or AS numbers (Autonomous System number). IPv4 and IPv6 are fully supported by NinjaFirewall.
fr_fr: Vous pouvez accepter de bloquer une adresse IP, une plage d'adresses ou un numéro AS (Autonomous System). NinjaFirewall est compatible avec l'IPv4 et l'IPv6.

source: IPv4 or IPv6:
fr_fr: IPv4 ou IPv6 :

source: %s or %s
fr_fr: %s ou %s

source: IP ranges using CIDR notation:
fr_fr: Plages IP utilisant la notation CIDR :

source: Autonomous System number:
fr_fr: Numéro AS (Autonomous System) :

source: This option allows you to slow down aggressive bots, crawlers, web scrapers or even small attacks. Any IP reaching the defined threshold will be banned from 1 to 9999 seconds. Note that the purpose of this feature is not to permanently block an IP but rather to temporarily prevent it from accessing the site and abusing your system resources. If you want to permanently block an IP, use the blacklist instead. By default, Rate Limiting is turned off.
fr_fr: Cette option vous permet de ralentir les bots, crawlers, web scrapers ou même de petites attaques HTTP. Toute IP dépassant la limite fixée sera bannie de 1 à 9999 secondes. Notez que le but de cette option est de bloquer temporairement une adresse IP. Si vous souhaitez bloquer définitivement une adresse IP, utilisez l'option "Contrôle d'accès par IP". Par défaut, la limitation du trafic n'est pas activée.

source: IPs temporarily banned by the Rate Limiting option can be unblocked immediately by clicking either the "Save Changes" or "Restore Default Values" buttons at the bottom of this page.
fr_fr: Les adresses IP temporairement bannies par cette option peuvent être débloquées simplement en cliquant sur les boutons "Sauvegarder les modifications" ou "Rétablir les valeurs par défaut" situés en bas de la page.

source: You can permanently allow or block any access to one or more PHP scripts based on their path, relative to the web root (<code>SCRIPT_NAME</code>). You can enter either a full or partial path (case-sensitive).
fr_fr: Vous pouvez immédiatement accepter ou bloquer tout accès à un script PHP en se basant sur son nom ou le(s) répertoire(s) de lequel il se trouve (<code>SCRIPT_NAME</code>). Vous pouvez entrer l'URL complète ou partielle, sensible à la casse.

source: <code>/foo/bar.php</code> will allow/block any access to the <code>bar.php</code> script located inside a <code>/foo/</code> directory (<code>http://domain.tld/foo/bar.php</code>, <code>http://domain.tld/another/directory/foo/bar.php</code> etc).
fr_fr: <code>/foo/bar.php</code> autorisera/bloquera tout accès au script PHP <code>bar.php</code> situé dans un répertoire <code>/foo/</code> (<code>http://domaine.tld/foo/bar.php</code>, <code>http://domaine.tld/autre/repertoire/foo/bar.php</code> etc).

source: <code>/foo/</code> will allow/block access to all PHP scripts located inside a <code>/foo/</code> directory.
fr_fr: <code>/foo/</code> autorisera/bloquera l'accès à tous les scripts PHP situés dans un répertoire <code>/foo/</code>.

source: You can block bots, scanners and various crawlers based on the <code>HTTP_USER_AGENT</code> variable. You can enter either a full or partial name (case-insensitive).
fr_fr: Vous pouvez bloquer les scanners, bots ou autres crawlers en entrant leur nom (<code>HTTP_USER_AGENT</code>) ou partie de celui-ci. La chaîne de caractères est insensible à la casse.

source: Log events
fr_fr: Journaliser

source: You can enable/disable firewall logging for each access control directive separately.
fr_fr: Vous pouvez activer/désactiver la journalisation des directives indépendamment les unes des autres.

source: In addition to the Firewall Policies and Access Control directives, NinjaFirewall includes also a large set of built-in rules used to protect your site against the most common vulnerabilities and hacking attempts. They are always enabled and you cannot edit them, but if you notice that your visitors are wrongly blocked by some of those rules, you can use the Rules Editor to disable them individually:
fr_fr: En plus des options configurables dans les menus "Pare-Feu > Contrôle d'Accès" et "Pare-Feu > Politique", NinjaFirewall dispose aussi de règles de sécurité spécifiques aux vulnérabilités les plus communes. Elle sont actives par défaut et vous ne pouvez pas les éditer. Cependant, elles peuvent être désactivées individuellement, notamment dans le cas où l'une d'entre-elles bloquerait certains de vos visiteurs par erreur :

source: Check your firewall log and find the rule ID you want to disable (it is displayed in the <code>RULE</code> column).
fr_fr: Consultez le journal du pare-feu afin d'y trouver l'ID de la règle que vous souhaitez désactiver (il est affiché dans la colonne <code>RULE</code>).

source: Select its ID from the enabled rules list below and click the "Disable it" button.
fr_fr: Sélectionnez son ID dans la liste des règles ci-dessous et cliquez sur le bouton "Désactiver".

source: If the <code>RULE</code> column from your log shows a hyphen <code>-</code> instead of a number, that means that the rule can be changed in your Firewall Policies page.
fr_fr: Note : Si la colonne <code>RULE</code> du journal indique un tiret <code>-</code> au lieu d'un nombre, c'est qu'il s'agit d'une règle qui peut être désactivée depuis la page "Pare-Feu &gt; Politiques".

source: File Guard can detect, in real-time, any access to a PHP script that was recently modified or created, and alert you about this.
fr_fr: File Guard peut détecter, en temps réel, tout accès à un script PHP ayant été créé ou modifié récemment, et vous en alerter par e-mail.

source: If a hacker uploaded a shell script to your site (or injected a backdoor into an already existing file) and tried to directly access that file using his browser or a script, NinjaFirewall would hook the HTTP request and immediately detect that the file was recently modified/created. It would send you a detailed alert (script name, IP, request, date and time). Alerts will be sent to the contact email address defined in the "Account &gt; Options" menu.
fr_fr: Si un hackeur injecte une backdoor dans l'un de vos scripts ou bien en télecharge une sur votre site, dès qu'il tentera d'y accéder avec son navigateur ou toute autre application, NinjaFirewall interceptera la requête et détectera immédiatement que ce script a été créé/modifié récemment. Il vous enverra une alerte par e-mail contenant les informations nécessaires (nom du script, IP, requête HTTP, date et heure). L'alerte sera envoyée à l'adresse indiquée dans le menu "Compte > Options > Contact".

source: Modifications detected by NinjaFirewall include file modifications as well as file permissions, and ownership changes.
fr_fr: Les modifications détectées par NinjaFirewall incluent la création ou modification du contenu d'un fichier, et la modification de ses propriétés et permissions.

source: If you do not want to monitor a folder, you can exclude its full path or a part of it (e.g., <code>/var/www/public_html/cache/</code>, <code>/cache/</code> etc). NinjaFirewall will compare this value to the <code>$_SERVER["SCRIPT_FILENAME"]</code> server variable and, if it matches, will ignore it. Multiple values must be comma-separated.
fr_fr: Si vous souhaitez exclure un répertoire, vous pouvez entrer son chemin complet ou une partie de celui-ci (ex. <code>/var/www/public_html/cache/</code>, <code>/cache/</code> etc). NinjaFirewall comparera cette valeur à la variable <code>$_SERVER["SCRIPT_FILENAME"]</code> et, si elle correspond, l'ignorera.<br>Plusieurs valeurs doivent être séparées par des virgules.

source: File Check lets you perform file integrity monitoring upon request.
fr_fr: File Check vous permet d'effectuer une analyse de l'intégrité de vos fichiers sur demande.

source: You need to create a snapshot of all your files and then, at a later time, you can scan your system to compare it with the previous snapshot. Any modification will be immediately detected: file content, file permissions, file ownership, timestamp as well as file creation and deletion.
fr_fr: Vous devez créer un instantané de tous vos fichiers, puis, ultérieurement, vous pouvez scanner votre système pour le comparer avec l'instantané précédent. Toute modification sera immédiatement détectée : contenu, permissions et propriétés des fichiers, leur création, suppression ainsi que l'horodatage.

source: By default, the directory is set to NinjaFirewall's parent directory.
fr_fr: Par défaut, il s'agit du répertoire parent de NinjaFirewall.

source: Exclude the following files/folders
fr_fr: Exclure les fichiers / dossiers suivants
