Repository: skimasax/prochatr
Catalog: public/ninja/locale/*/LC_MESSAGES/ninjafirewall_pro-*.po
Languages: fr_fr

source: You can enter a directory or a file name (e.g., <code>/foo/bar/</code>), or a part of it (e.g., <code>foo</code>). Or you can exclude a file extension (e.g., <code>.css</code>). Multiple values must be comma-separated (e.g., <code>/foo/bar/,.css,.png</code>).
fr_fr: Vous pouvez entrer un répertoire ou un nom de fichier (par ex. <code>/foo/bar/</code>), ou une partie de celui-ci (par ex. <code>foo</code>), ou même exclure une extension de fichier (par ex. <code>.css</code>). Plusieurs valeurs doivent être séparées par des virgules (par ex. <code>/foo/bar/,.css,.png</code>).

source: Do not follow symbolic links
fr_fr: Ne pas suivre les liens symboliques

source: By default, NinjaFirewall will not follow symbolic links.
fr_fr: Par défaut, NinjaFirewall ignore les liens symboliques lors de son analyse des fichiers.

source: If NinjaFirewall can hook and scan incoming requests, it can also hook the response body (i.e., the output of the HTML page right before it is sent to your visitors browser) and search it for some specific keywords. Such a filter can be useful to detect hacking or malware patterns injected into your HTML code (text strings, spam links, malicious JavaScript code), hackers shell script, redirections and even errors (PHP/MySQL errors).
fr_fr: Si NinjaFirewall peut filtrer les requêtes HTTP entrantes, il peut aussi intercepter les requêtes sortantes, c'est à dire le contenu de la page HTML juste avant que celui-ci ne soit envoyé au navigateur de l'utilisateur. Ce type de filtre est particulièrement intéressant pour détecter du code malveillant injectés dans vos pages HTML (texte, liens, code JavaScript etc), des scripts utilisés par les hackers (shell, backdoor) et même des erreurs (PHP, MySQL).

source: In the case of a positive detection, NinjaFirewall will not block the response body but will send you an alert by email.
fr_fr: En cas de détection positive, NinjaFirewall ne bloquera pas la requête mais vous enverra immédiatement une alerte par e-mail.

source: Search HTML page for:
fr_fr: Rechercher dans la page HTML :

source: You can enter any keyword from 4 to 150 characters and select whether the search will be case sensitive or not.
fr_fr: Vous pouvez entrer de 4 à 150 caractères et sélectionner si la recherche est sensible à la casse.

source: Email Alerts
fr_fr: Alertes E-mail

source: You can use the notification throttling option to limit the frequency of alerts sent to you (and written to the firewall log) and select whether you want NinjaFirewall to send you the whole HTML source of the page where the keyword was found. Alerts will be sent to the contact email address defined in the "Account &gt; Options" menu.
fr_fr: L'alerte sera envoyée à l'adresse indiquée dans le menu "Compte > Options > Contact". La page HTML ayant déclenché cette alerte peut être jointe à l'e-mail.

source: Response body filtering can be resource-intensive. Try to limit the number of keywords to what you really need (&lt;10) and/or, if possible, prefer case sensitive to case insensitive filtering.
fr_fr: Filtrer les requêtes sortantes peut être gourmand en ressources. Essayez de limiter le nombre de mots-clés (&lt;10) et/ou, si possible, préférez la recherche sensible à la casse.

source: The firewall log displays blocked and sanitised requests as well as some useful information. It has 6 columns:
fr_fr: Le journal du pare-feu affiche les requêtes HTTP qui ont été bloquées ou nettoyées ainsi que d'autres informations utiles. Il a six colonnes :

source: Date and time of the incident.
fr_fr: Date et heure de l'incident.

source: Unique incident number/ID as it was displayed to the blocked user.
fr_fr: Le numéro d'incident (ID) unique. Par défaut, il sera aussi affiché à l'utilisateur dont la requête aura été bloquée par le pare-feu.

source: Level of severity (medium, high or critical), information (info, error, upload) and debugging mode (DEBUG_ON).
fr_fr: Sévérité des attaques (moyen, élevé ou critique), information (info, erreur, téléchargement) et mode débogage (DEBUG_ON).

source: Reference of the NinjaFirewall built-in security rule that triggered the action. A hyphen (<code>-</code>) instead of a number means it was a rule from your own Firewall Policies or Access Control page.
fr_fr: Le numéro de référence de la règle de sécurité qui a été utilisée pour bloquer la requête HTTP. Un trait d'union (<code>-</code>) à la place d'un numéro signifie que la règle provient soit de votre configuration personnelle "Politique" ou "Contrôle d'Accès" du menu "Pare-Feu".

source: The blocked user remote address.
fr_fr: L'adresse IP de l'utilisateur bloqué.

source: The HTTP request including offending variables & values as well as the reason the action was logged.
fr_fr: La requête HTTP avec ses variables et valeurs, ainsi que la raison qui a déclenché l'incident.

source: The log can also be exported as a TSV (tab-separated values) text file.
fr_fr: Le journal peut également être exporté dans un fichier au format TSV (valeurs séparées par des tabulations).

source: You can disable/enable the firewall log from this page.
fr_fr: Vous pouvez activer / désactiver le journal du pare-feu à partir de cette page.

source: NinjaFirewall will rotate its log automatically on the very first day of each month. If your site is very busy, you may want to allow it to rotate the log when it reaches a certain size (MB) as well. By default, if will rotate the log each month or earlier, if it reaches 2 megabytes.
fr_fr: NinjaFirewall effectue une rotation automatique du journal le premier jour de chaque mois. Vous pouvez le configurer pour que la rotation soit effectuée plus tôt, dans le cas où le journal aurait atteint une certaine taille (Mo). Par défaut, cette taille est fixée à 2 Mo.

source: Rotated logs, if any, can be selected and viewed from the dropdown menu.
fr_fr: Les journaux des mois précédents sont accessibles depuis le menu déroulant situé au dessus de la fenêtre.

source: If the log is too large, only the last 1500 lines will be displayed. It can be changed with this option.
fr_fr: Si le journal est trop volumineux, seules les 1500 dernières lignes seront affichées. Cette valeur peut-être changée avec cette option.

source: In addition to the firewall log, events can also be redirected to the syslog server (<code>LOG_USER</code> facility). If you have a shared hosting account, keep this option disabled as you do not have any access to the server logs.
fr_fr: En plus d'écrire dans son journal, le pare-feu peut aussi utiliser le serveur Syslog (catégorie <code>LOG_USER</code>). Si vous avez un hébergement mutualisé, laissez cette option désactivée car vous n'avez pas accès aux journaux du serveur.

source: The logline uses the following format:
fr_fr: Le format utilisé est le suivant :

source: the process ID (PID).
fr_fr: l'identifiant de processus (PID).

source: the level of severity as it appears in the firewall log. It can be <code>CRITICAL</CODE>, <CODE>HIGH</CODE>, <CODE>MEDIUM</CODE>, <CODE>INFO</CODE>, <CODE>UPLOAD</CODE> or <CODE>DEBUG_ON</CODE>.
fr_fr: le niveau de sévérité des attaques tel qu'il apparaît dans le journal du pare-feu. Cela peut être <code>CRITICAL</code>, <code>HIGH</code>, <code>MEDIUM</code>, <code>INFO</code>, <code>UPLOAD</code> ou <code>DEBUG_ON</code>.

source: the 7-digit incident ID.
fr_fr: le numéro d'incident à sept chiffres.

source: the user IPv4 or IPv6 address.
fr_fr: l'adresse IPv4 ou IPv6 de l'utilisateur.

source: the website (sub-)domain name.
fr_fr: le nom de (sous-)domaine du site.

source: Centralized Logging lets you remotely access the firewall log of all your NinjaFirewall protected websites from one single installation. You do not need any more to log in to individual servers to analyse your log data.
fr_fr: La Centralisation des Logs vous permet d’accéder, depuis votre site principal, au journal du pare-feu de chacun de vos sites protégés par NinjaFirewall. Vous n'avez plus besoin de vous connecter à chaque site pour analyser vos journaux.

source: This is the public key that was created from your main server.
fr_fr: Il s'agit de la clé qui a été créée depuis le serveur principal.

source: Centralized Logging will keep working even if NinjaFirewall is disabled. Delete your public key if you want to disable it.
fr_fr: L'option de centralisation des logs fonctionnera même si vous désactivez NinjaFirewall. Si vous souhaitez complètement désactiver cette option, supprimez votre clé publique.

source: Live Log lets you watch your blog traffic in real time, just like the Unix <code>tail -f</code> command. Note that requests sent to static elements like JS/CSS files and images are not managed by NinjaFirewall.
fr_fr: Cette fonctionnalité vous permet de voir, en direct, les connexions en cours en vous les affichant dans un format similaire à celui de la commande Unix <code>tail -f</code>. Notez que les requêtes concernant les éléments statiques comme les fichiers JS/CSS ou les images ne sont pas traitées par NinjaFirewall.

source: You can enable/disable the monitoring process, change the refresh rate, clear the screen, enable automatic vertical scrolling, change the log format and select which traffic you want to view (HTTP/HTTPS).
fr_fr: Vous pouvez activer/stopper le processus, régler l'intervalle de rafraîchissement de la page, activer le défilement vertical automatique, effacer l'écran, changer le format d'affichage et choisir le type de trafic à visualiser (HTTP/HTTPS).

source: You can also apply filters to include or exclude files and folders (REQUEST_URI).
fr_fr: Vous pouvez également appliquer des filtres pour inclure ou exclure des fichiers et des dossiers (REQUEST_URI).

source: Log Format
fr_fr: Format d'affichage

source: You can easily customize the log format. Possible values are:
fr_fr: Vous pouvez facilement changer le format d'affichage en combinant une ou plusieurs des valeurs suivantes :

source: The server date, time and timezone.
fr_fr: La date, heure et fuseau horaire du serveur.

source: Authenticated user (HTTP basic auth), if any.
fr_fr: Le nom de l'utilisateur (Authentification HTTP basic), si il existe.

source: The client REMOTE_ADDR. If you are behind a load balancer or CDN, this will be its IP.
fr_fr: L'adresse IP du client (REMOTE_ADDR). Si votre serveur est derrière un CDN ou un proxy, cette variable retournera l'adresse IP de celui-ci.

source: HTTP method (e.g., GET, POST).
fr_fr: La méthode HTTP (par ex. GET, POST).

source: The URI which was given in order to access the page (REQUEST_URI).
fr_fr: L'URI donnée pour accéder à la page (REQUEST_URI).

source: The referrer (HTTP_REFERER), if any.
fr_fr: Le referrer (HTTP_REFERER), si il existe.

source: The user-agent (HTTP_USER_AGENT), if any.
fr_fr: L'en-tête User_Agent (HTTP_USER_AGENT), si il existe.

source: HTTP_X_FORWARDED_FOR, if any. If you are behind a load balancer or CDN, this will likely be the visitor true IP.
fr_fr: L'en-tête HTTP_X_FORWARDED_FOR, si il existe. Si votre serveur est derrière un CDN ou un proxy, cette variable retournera probablement l'adresse réelle du client.

source: Additionally, you can include any of the following characters:
fr_fr: Vous pouvez aussi utiliser les caractères suivants :

source: If you are using the optional <code>.htninja</code> configuration file to whitelist your IP, the Live Log feature will not work.
fr_fr: Si vous utilisez le fichier optionnel de configuration <code>.htninja</code> pour toujours accepter les requêtes provenant de votre adresse IP, Live Log ne fonctionnera pas.

source: Centralized Logging lets you remotely access the firewall log of all your NinjaFirewall protected websites from one single installation. You do not need any more to log in to individual servers to analyse your log data. There is no limit to the number of websites you can connect to, and they can be running any edition of NinjaFirewall: WP, WP+, Pro or Pro+.
fr_fr: La Centralisation des Logs vous permet d’accéder, depuis votre site principal, au journal du pare-feu de chacun de vos sites protégés par NinjaFirewall. Vous n'avez plus besoin de vous connecter à chaque site pour analyser vos journaux. Vous pouvez vous connecter à un nombre illimité de sites, quelque soit leur version de NinjaFirewall : WP, WP+, Pro or Pro+.

source: The secret key will be used to generate your public key. Enter at least 30 ASCII characters, or use the one randomly created by NinjaFirewall.
fr_fr: Cette clé sera utilisée pour créer votre clé publique. Entrez de 30 à 100 caractères ASCII, ou bien utilisez la clé générée aléatoirement par NinjaFirewall.

source: As an additional protection layer, you can restrict access to the remote website(s) to the main server's IP only. You can use IPv4 or IPv6. If you do not want any IP restriction, enter the <code>*</code> character instead.
fr_fr: Seule cette adresse IPv4 ou IPv6 sera autorisée à se connecter aux sites distants. Si vous ne souhaitez pas de restriction d’accès par IP, veuillez entrer le caractère <code>*</code>.

source: This is the public key that you will need to upload to each remote website.
fr_fr: Vous devez configurer vos sites distants avec cette clé.

source: Enter the full URL of your NinjaFirewall protected website(s) that you want to remotely access from the main server.
fr_fr: Entrez l'URL complète des sites protégés par NinjaFirewall auxquels vous souhaitez accéder à distance à partir du serveur principal.

source: Centralized Logging will keep working even if NinjaFirewall is disabled. Use this menu if you want to disable it.
fr_fr: L'option de centralisation des logs fonctionnera même si vous désactivez NinjaFirewall. Si vous souhaitez complètement désactiver cette option, faites-le depuis ce menu.

source: No help available for this page.
fr_fr: Aucune aide disponible pour cette page.

source: Warning: ensure that you can access your admin console over HTTPS before enabling this option, otherwise you will lock yourself out of your site. Continue?
fr_fr: Attention : assurez-vous de bien disposer d'une connexion HTTPS avant d'activer cette option, sinon vous risqueriez de ne plus pouvoir accéder à l'interface d'administration. Continuer ?

source: Refresh preview
fr_fr: Réactualiser

source: Your message seems to contain Javascript code. For security reason, it cannot be previewed from the admin dashboard.
fr_fr: Votre message semble contenir du code Javascript. Pour des raisons de sécurité, il ne peut pas être visualisé à partir du tableau de bord de l'administrateur.

source: Any character that is not a letter [a-zA-Z], a digit [0-9], a dot [.], a hyphen [-] or an underscore [_] will be removed from the filename and replaced with the substitution character. Continue?
fr_fr: Tout caractère qui n'est pas une lettre [a-zA-Z], un chiffre [0-9], un point [.], un trait d'union [-] ou un caractère de soulignement [_], sera remplacé par le caractère de substitution. Continuer ?

source: Warning: you have selected to block all available countries in the Geolocation Access Control. Are you sure you want to continue?
fr_fr: Attention, vous avez choisi de bloquer tous les pays disponibles dans le "Contrôle d'accès par Géolocalisation". Êtes-vous sûr de vouloir continuer ?

source: Delete the current snapshot?
fr_fr: Supprimer l'instantané actuel ?

source: Enter at least one keyword or disable the Web Filter.
fr_fr: Entrez au moins un mot-clé ou désactivez Web Filter.

source: Keywords must be from 4 to maximum 150 characters.
fr_fr: Les mots-clés doivent faire de 4 à 150 caractères.

source: The vertical bar "|" character is not allowed.
fr_fr: La barre verticale "|" n'est pas autorisée.

source: No records were found that match the specified search criteria.
fr_fr: Aucune donnée ne correspond aux critères de recherche spécifiés.

source: Your public key is not valid.
fr_fr: Votre clé publique n'est pas valide.

source: Please enter an IP address.
fr_fr: Veuillez entrer une adresse IP.

source: No traffic yet, please wait
fr_fr: Aucun visiteur actuellement, veuillez patienter

source: seconds...
fr_fr: secondes...

source: Error: Live Log did not receive the expected response from your server:
fr_fr: Erreur : le serveur distant n\'a pas retourné la réponse attendue :

source: Error: URL does not seem to exist (404 Not Found):
fr_fr: Erreur : l'URL ne semble pas exister (404 Not Found) :

source: Error: Cannot find your log file. Try to reload this page.
fr_fr: Erreur : Impossible de trouver le fichier log. Essayez de recharger cette page.

source: Error: The HTTP server returned the following error code:
fr_fr: Erreur : Le serveur HTTP a retourné le code d'erreur suivant :

source: Click the "Save Options" button to generate your new public key.
fr_fr: Cliquez sur "Sauvegarder les options" pour créer votre nouvelle clé publique.

source: You will need to upload that new key to the remote server(s).
fr_fr: Vous devez configurer vos sites distants avec cette nouvelle clé.

source: Please enter a secret key, from 30 to 100 ASCII printable characters. It will be used to generate your public key.
fr_fr: Veuillez créer votre clé privée, de 30 à 100 caractères ASCII. Elle sera utilisée pour générer votre clé publique.

source: Please enter this server IP address.
fr_fr: Veuillez entrer l'adresse IP de ce serveur.

source: Unknown file type %s
fr_fr: Type de fichier inconnu %s

source: Cannot find the "%s" file. Please review your NinjaFirewall installation.
fr_fr: Le fichier "%s" est manquant. Veuillez réinstaller NinjaFirewall.

source: The "%s" is not writable. Please change its permissions.
fr_fr: Le répertoire "%s" est en lecture seule. Veuillez changer ses permissions afin qu'il soit accessible en écriture.

source: An error occurred while writing to the "%s" file.
fr_fr: Une erreur s'est produite lors de l'écriture dans le fichier "%s".

source: Pro Edition (upgrade to %s)
fr_fr: Pro Edition (acheter une licence %s)

source: (upgrade to %s)
fr_fr: (acheter une licence %s)

source: This feature is only available in the <a href="%s">Pro+ Edition</a> of NinjaFirewall.
fr_fr: Cette fonctionnalité n'est disponible que dans la version <a href="%s">Pro+ Edition</a> de NinjaFirewall.

source: The log was deleted.
fr_fr: Le journal a été supprimé.

source: Warning, NinjaFirewall is not working and your site is not protected.
fr_fr: Attention, NinjaFirewall ne fonctionne pas et votre site n'est pas protégé.

source: Error message: %s
fr_fr: Message d'erreur : %s

source: License expiration
fr_fr: Expiration licence

source: Click here to renew it.
fr_fr: Cliquez ici pour la renouveler.

source: Unable to retrieve updates information from NinjaFirewall server.
fr_fr: Impossible de récupérer les informations de mise à jour depuis les serveurs de NinjaFirewall.

source: A new version is available.
fr_fr: Une nouvelle version est disponible.

source: Click here to update.
fr_fr: Cliquez ici pour faire la mise à jour.

source: The public key is invalid. Please %scheck your configuration%s.
fr_fr: La clé publique est invalide. Veuillez vérifier %svotre configuration%s.

source: No IP address restriction.
fr_fr: Aucune restriction d'accès par adresse IP.

source: IP address %s is allowed to access NinjaFirewall's log on this server.
fr_fr: L'adresse IP %s est autorisée à accéder au journal du pare-feu de NinjaFirewall.

source: The whitelisted IP is not valid. Please %scheck your configuration%s.
fr_fr: L'adresse IP est invalide. Veuillez vérifier %svotre configuration%s.

source: Error: %s
fr_fr: Erreur : %s

source: Debugging
fr_fr: Débogage

source: NinjaFirewall is running in <i>Debug Mode</i>, do not forget to <a href="%s">disable it</a> before going live.
fr_fr: NinjaFirewall est en mode <i>Débogage</i>, n'oubliez pas de <a href="%s">désactiver celui-ci</a> avant de mettre votre serveur en production.

source: The log is disabled.
fr_fr: Le journal du pare-feu est désactivé.

source: Click here to re-enable it
fr_fr: Cliquez ici pour le réactiver

source: <a href="%s">Access Control Source IP</a> is setup to use %s, however your server does not support that variable. All IP-based directives will fail.
fr_fr: L'<a href="%s">IP Source</a> est configurée pour utiliser %s, cependant votre serveur n'utilise pas cette variable. Toutes les directives basées sur une adresse IP échoueront.

source: You have a private IP: %s
fr_fr: Vous avez l'adresse IP d'un réseau privé : %s

source: If your site is behind a reverse proxy or a load balancer, ensure that the <a href="%s">Source IP</a> is setup accordingly.
fr_fr: Si votre site est derrière un CDN ou reverse proxy, pensez à configurer correctement l'option <a href="%s">IP Source</a>.

source: CDN detection
fr_fr: Détection CDN

source: %s detected: you seem to be using %s CDN services.
fr_fr: %s détecté : vous semblez utiliser les services de %s.

source: Ensure that you have setup your HTTP server or PHP to forward the correct visitor IP, otherwise use the <a href="%s">.htninja configuration file</a>.
fr_fr: Assurez-vous d'avoir configuré votre serveur HTTP pour qu'il utilise la bonne adresse IP, sinon, utilisez <a href="%s">le fichier .htninja</a> prévu à cet effet.

source: Ensure that the <a href="%s">Source IP</a> is setup accordingly.
fr_fr: Assurez-vous que l'option <a href="%s">IP source</a> a bien été configurée correctement.

source: Log Directory
fr_fr: Répertoire des Fichier Journaux

source: Warning, the "%s" directory is not writable, please chmod it to 0777 or equivalent.
fr_fr: Attention, le répertoire "%s" est en lecture seule. Changez ses permissions en 0777 ou équivalent.

source: Cache Directory
fr_fr: Répertoire du Cache

source: Configuration Directory
fr_fr: Répertoire de la Configuration

source: Optional configuration file
fr_fr: Fichier de configuration

source: Last login
fr_fr: Dernière Connexion

source: Admin Log
fr_fr: Journal Administrateur

source: Delete log
fr_fr: Supprimer le journal

source: You do not have any statistics for the current month.
fr_fr: Vous n'avez pas de statistiques pour le mois en cours.

source: Statistics period
fr_fr: Période des statistiques

source: Blocked threats
fr_fr: Menaces bloquées

source: Threats level
fr_fr: Niveau des menaces

source: Uploaded files
fr_fr: Fichiers téléchargés (upload)

source: Average time per request
fr_fr: Durée moyenne par requête

source: seconds
fr_fr: secondes

source: Fastest request
fr_fr: Requête la plus rapide

source: Slowest request
fr_fr: Requête la plus lente

source: Select monthly stats to view
fr_fr: Sélectionnez les statistiques à afficher

source: The following directory was found: "install/". Please delete it and reload this page to access the login page.
fr_fr: Le répertoire suivant a été trouvé "install/". Veuillez le supprimer et recharger cette page afin d'accéder à votre console d'administration.

source: Error : cannot find the "install.php" file.
fr_fr: Erreur : impossible de trouver le fichier "install.php".

source: Too many failed login attempts, you have been banned for %s minutes.
fr_fr: Trop de tentatives de connexion ont échoué, vous avez été banni pendant %s minutes.

source: Your session has been closed.
fr_fr: Votre session est terminée.

source: Your session has expired.
fr_fr: Votre session a expiré.

source: Wrong username or password.
fr_fr: Utilisateur ou mot de passe invalide.

source: Use <a href="%s">this script</a> if you need to reset your password.
fr_fr: Utilisez <a href="%s">ce script</a> si vous souhaitez réinitialiser votre mot de passe.

source: [NinjaFirewall] Admin console login
fr_fr: [NinjaFirewall] Connexion à la console d'administration

source: Someone just logged in to your NinjaFirewall admin interface:
fr_fr: Quelqu'un vient de se connecter à votre console d'administration de NinjaFirewall :

source: Admin login
fr_fr: Console d'administration
