Repository: skimasax/prochatr
Catalog: public/ninja/locale/*/LC_MESSAGES/ninjafirewall_pro-*.po
Languages: fr_fr

source: Force HttpOnly flag on all cookies to mitigate XSS attacks
fr_fr: Active la propriété HttpOnly pour les cookies afin d'atténuer les menaces XSS

source: If your PHP scripts send cookies that need to be accessed from JavaScript, you should keep this option disabled.
fr_fr: Si vos scripts PHP envoient des cookies qui doivent être accessibles à partir de JavaScript, vous devez garder cette option désactivée.

source: HSTS headers can only be set when you are accessing your site over HTTPS.
fr_fr: Les en-têtes HSTS ne peuvent être activés que lorsque vous vous connectez à votre site en HTTPS.

source: Set Strict-Transport-Security (HSTS) to enforce secure connections to the server
fr_fr: Activer Strict-Transport-Security (HSTS) pour forcer les connexions sécurisées vers le serveur

source: Set "max-age" to 0
fr_fr: Régler "max-age" à 0

source: 1 month
fr_fr: 1 mois

source: 6 months
fr_fr: 6 mois

source: 1 year
fr_fr: 1 an

source: Apply to all subdomains
fr_fr: Appliquer aux sous-domaines

source: Set Content-Security-Policy
fr_fr: Activer Content-Security-Policy

source: Set Referrer-Policy (Chrome, Opera and Firefox browsers)
fr_fr: Activer Referrer-Policy (Chrome, Opera et Firefox)

source: Block PHP built-in wrappers in GET, POST, HTTP_USER_AGENT, HTTP_REFERER and cookies
fr_fr: Bloquer les gestionnaires PHP dangereux (wrappers) dans les variables GET, POST, HTTP_USER_AGENT, HTTP_REFERER et les cookies

source: Block serialized PHP objects in the following global variables
fr_fr: Bloquer les objets PHP sérialisés dans les variables globales suivantes

source: Hide PHP notice and error messages
fr_fr: Masquer les messages d'erreur de PHP

source: Various
fr_fr: Divers

source: Block the DOCUMENT_ROOT server variable in HTTP request
fr_fr: Bloquer les requêtes HTTP contenants la variable DOCUMENT_ROOT

source: Block ASCII character 0x00 (NULL byte)
fr_fr: Bloquer le caractère ASCII 0x00 (NULL byte)

source: Block ASCII control characters 1 to 8 and 14 to 31
fr_fr: Bloquer les caractères de contrôle ASCII 1 à 8 et 14 à 31

source: Block localhost IP in GET/POST request
fr_fr: Bloquer les requêtes GET/POST contenants l'IP localhost

source: Block HTTP requests with an IP in the HTTP_HOST header
fr_fr: Bloquer les requêtes HTTP dont l'en-tête HTTP_HOST contient une IP

source: Accept the following HTTP methods
fr_fr: Accepter les méthodes HTTP suivantes

source: GET, POST and HEAD only
fr_fr: GET, POST et HEAD uniquement

source: Any HTTP method
fr_fr: Toute méthode HTTP

source: You did not select a rule.
fr_fr: Vous n'avez pas sélectionné de règle.

source: To change this rule, use the "Firewall Policies" menu.
fr_fr: Pour changer cette règle, utilisez le menu "Politiques du pare-feu".

source: This rule does not exist.
fr_fr: Cette règle n'existe pas.

source: Rule #%s has been disabled
fr_fr: La Règle #%s a été désactivée

source: Rule #%s has been enabled
fr_fr: La Règle #%s a été activée

source: Fatal error: No rules found. Reinstall NinjaFirewall to solve the problem.
fr_fr: Erreur fatale : le pare-feu n'a pas de règles. Réinstallez NinjaFirewall pour résoudre le problème.

source: Select the rule you want to enable or disable
fr_fr: Sélectionnez la règle à activer ou désactiver

source: Enabled rules:
fr_fr: Règles activées :

source: Code injection
fr_fr: Injection de code

source: SQL injection
fr_fr: Injection SQL

source: Various vulnerability
fr_fr: Diverses vulnérabilités

source: Application specific
fr_fr: Application spécifique

source: Rule #
fr_fr: Règle #

source: Disable it
fr_fr: Désactiver

source: Disabled rules:
fr_fr: Règles désactivées :

source: Enable it
fr_fr: Activer

source: Enable Web Filter
fr_fr: Activer Web Filter

source: Search HTML page for the following keywords
fr_fr: Rechercher les mots suivants dans la page HTML

source: A full or partial string.
fr_fr: Chaîne de caractère complète ou partielle.

source: From 4 to maximum 150 characters.
fr_fr: De 4 à 150 caractères.

source: Any character, except the vertical bar <code>|</code>
fr_fr: Tout caractère, sauf la barre verticale <code>|</code>

source: Keywords to search:
fr_fr: Mots-clés recherchés :

source: Case-sensitive search
fr_fr: Recherche sensible à la casse

source: Email alert
fr_fr: Alertes E-mail

source: 5-minute
fr_fr: 5 minutes

source: 15-minute
fr_fr: 15 minutes

source: 30-minute
fr_fr: 30 minutes

source: 1-hour
fr_fr: 1 heure

source: 3-hour
fr_fr: 3 heures

source: 6-hour
fr_fr: 6 heures

source: 12-hour
fr_fr: 12 heures

source: 24-hour
fr_fr: 24 heures

source: Do not send me more than one email alert in a %s interval.
fr_fr: Ne pas envoyer plus d'un e-mail par tranche de %s.

source: Clicking the "Save Changes" button below will reset the current timer.
fr_fr: Cliquer sur "Sauvegarder les modifications" réinitialisera le compteur.

source: Attach the HTML page output to the email alert
fr_fr: Joindre la page HTML à l'e-mail

source: The "Overview" page is NinjaFirewall's dashboard. It is very important that you keep an eye on it because any potential warning or error will be printed there.
fr_fr: La page "Aperçu" affiche toutes les informations relatives au bon fonctionnement du pare-feu ainsi que les mises à jour; il vous est conseillé de la consulter fréquemment car, en cas de problèmes, ceux-ci seront indiqués ici.

source: Statistics are taken from the current firewall log. They display the number of threats, their level as well as some benchmarks showing the time NinjaFirewall took, in seconds, to process each request it has blocked.
fr_fr: Les statistiques sont tirées du journal du pare-feu. Elles affichent le nombre de menaces, leur niveau ainsi que quelques benchmarks indiquant le temps qu'il a fallu à NinjaFirewall pour intercepter, analyser et bloquer les requêtes dangereuses.

source: You can change your admin password using this form. It must contains at least 6 characters.
fr_fr: Le mot de passe de l'administrateur doit contenir au moins 6 caractères.

source: You can change your contact email addresss where NinjaFirewall will send you alerts and notifications.
fr_fr: Entrez l'adresse e-mail où seront envoyées les alertes et notifications de NinjaFirewall.

source: You can change the timezone (used for email notifications and the firewall log) and select your language.
fr_fr: Vous pouvez changer le fuseau horaire (utilisé pour les notifications envoyées par e-mail ainsi que pour le journal du pare-feu) et sélectionner la langue de votre choix.

source: You can use your own style sheet to customize NinjaFirewall UI.
fr_fr: Vous pouvez utiliser votre propre feuille de style (CSS) pour personnaliser l'interface utilisateur NinjaFirewall.

source: An email can be sent to you whenever someone logs in to your NinjaFirewall admin console. It is enabled by default.
fr_fr: Un e-mail peut vous être envoyé lorsqu'une personne se connecte à l'interface d'administration de NinjaFirewall. Cette option est activée par défaut.

source: You can force a secure connection to the login page. Ensure that you can access your admin console over HTTPS before enabling this option, otherwise you will lock yourself out.
fr_fr: Vous pouvez forcer l'accès à l'interface d'administration de NinjaFirewall via une connexion sécurisée uniquement. Si vous activez cette option, assurez-vous de bien disposer d'une connexion HTTPS, sinon vous risqueriez de ne plus pouvoir accéder à l'interface d'administration.

source: NinjaFirewall can check for available updates each time you log in to the admin dashboard.
fr_fr: NinjaFirewall peut vérifier les mises à jour disponibles chaque fois que vous vous connectez à son interface d'administration.

source: Your license is valid until the indicated expiration date. If you don't renew it after this date, NinjaFirewall will keep working and protecting your website as usual, but updates/upgrades will stop. You can renew your license from NinTechNet.com's website 30 days before its expiration date.
fr_fr: Votre licence est valide jusqu'à la date indiquée. Si, passé cette date, vous ne la renouvelez pas, NinjaFirewall fonctionnera toujours mais vous ne pourrez plus faire de mise à jour du logiciel. Vous pouvez renouveler votre licence depuis le site NinTechNet.com à partir du 30e jour précédent sa date d'expiration.

source: After installing NinjaFirewall, all available updates and upgrades can be installed from this page.
fr_fr: Lorsqu'elles sont disponibles, les mises à jour de NinjaFirewall se font depuis cette page, simplement en cliquant sur le bouton vous invitant à le faire.

source: You can also follow us on Twitter (@nintechnet) to get immediate notifications about updates.
fr_fr: Vous pouvez aussi suivre notre compte Twitter (@nintechnet) où seront indiquées les mises à jour.

source: This option allows you to disable NinjaFirewall. Your site will remain unprotected until you enable it again.
fr_fr: Cette option vous permet de rapidement désactiver le pare-feu. Votre site ne sera plus protégé par NinjaFirewall durant cette période.

source: Note that if you are using the <code>.htninja</code> file, it will not be disabled. If you want to disable it too, you either need to rename or delete it.
fr_fr: Si vous utilisez le fichier <code>.htninja</code>, celui-ci ne sera pas affecté par cette option. Si vous souhaitez le désactiver aussi, vous devrez soit le renommer, soit le supprimer.

source: In Debug mode, NinjaFirewall will not block or sanitise suspicious requests but will only log them (the firewall log will display <code>DEBUG_ON</code> in the LEVEL column).
fr_fr: Lorsque ce mode est activé, NinjaFirewall ne bloque pas les requêtes mais les enregistre uniquement dans le journal du pare-feu (les lignes correspondantes seront indiquée par la mention DEBUG_ON dans la colonne LEVEL du journal).

source: We recommend to run it in Debug Mode for at least 24 hours after installing it on a new site and then to keep an eye on the firewall log during that time. If you notice a false positive in the log, you can simply use NinjaFirewall's Rules Editor to disable the security rule that was wrongly triggered.
fr_fr: Nous vous conseillons de laisser NinjaFirewall en Mode débogage pendant 24 heures après son installation sur un nouveau site afin de vous assurer que tout fonctionne bien. Vous pourrez pendant cette période consulter le journal du pare-feu pour y voir les éventuels problèmes et, le cas échéant, désactiver les options ou règles pouvant créer des faux-positifs.

source: HTTP error code and blocked user message to return
fr_fr: Code HTTP et message à retourner

source: Lets you customize the HTTP error code returned by NinjaFirewall when blocking a dangerous request and the message to display to the user. You can use any HTML tags and 2 built-in variables:
fr_fr: Vous permet de choisir le code HTTP que vous souhaitez que NinjaFirewall retourne lorsqu'il bloque une requête dangereuse ainsi que le message à afficher à l'utilisateur bloqué. Vous pouvez utiliser le langage HTML ainsi que les 2 variables suivantes :

source: The blocked user IP.
fr_fr: L'adresse IP de l'utilisateur.

source: The unique incident number as it will appear in the firewall log "INCIDENT" column.
fr_fr: Le numéro d'incident, tel qu'il apparaîtra dans la colonne "INCIDENT" du journal du pare-feu.

source: IP anonymization
fr_fr: Anonymisation IP

source: This option will anonymize IP addresses in the firewall log by removing their last 3 characters. It does not apply to private IP addresses.
fr_fr: Cette option anonymise les adresses IP dans le journal du pare-feu en supprimant leurs 3 derniers caractères. Elle ne s'applique pas aux adresses IP privées.

source: Note that it will affect only IP addresses written to the firewall log after enabling this option.
fr_fr: Notez que seules les adresses IP enregistrées dans le journal du pare-feu après avoir activé cette option sont concernées.

source: If you are redirecting events to the syslog server (Logs > Firewall Log), IP addresses will be anonymized too.
fr_fr: En outre, si vous redirigez les événements vers le serveur syslog (Journaux > Journal du pare-feu), les adresses IP y seront également anonymisées.

source: Ban offending IP
fr_fr: Bannir les adresses IP incriminées

source: In addition to rejecting the request, NinjaFirewall can also ban the offending IP depending on the level of the severity. If you decide to ban IPs, use the submenu to select the time that IPs will be banned (from 1 to max 9999 minutes).
fr_fr: En plus de rejeter la demande, NinjaFirewall peut également bannir l’adresse IP incriminée en fonction du niveau de gravité. Si vous décidez de bannir les adresses IP, utilisez le sous-menu pour sélectionner la durée (de 1 à 9 999 minutes maximum).

source: To unban one or more IPs, select it/them in the listbox and click on the "Save Changes" button.
fr_fr: Sélectionnez dans la liste les adresses IP à débloquer, puis cliquez sur le bouton "Sauvegarder les modifications".

source: By default, IPs are not banned.
fr_fr: Par défaut, cette option est désactivée.

source: Because NinjaFirewall sits in front of your application, it can hook, scan and sanitise all PHP requests, HTTP variables, headers and IPs before they reach your site: <code>$_GET</code>, <code>$_POST</code>, <code>$_COOKIE</code>, <code>$_REQUEST</code>, <code>$_FILES</code>, <code>$_SERVER</code> in either or both HTTP & HTTPS mode.
fr_fr: Parcequ'il agit en amont de votre application, NinjaFirewall peut intercepter, scanner, nettoyer et bloquer les requêtes HTTP envoyées à un script PHP, ainsi que les variables ($_GET, $_POST, $_COOKIES, $_REQUEST, $_FILES, $_SERVER), en-têtes et adresses IP, avant que celles-ci n'atteignent votre application, que ce soit en mode HTTP ou HTTPS.

source: Use the options below to enable, disable or to tweak these rules according to your needs.
fr_fr: Utilisez les options ci-dessous pour configurer NinjaFirewall suivant vos besoins.

source: Scan and Sanitise
fr_fr: Filtrer et Nettoyer

source: You can choose to scan and reject dangerous content but also to sanitise requests and variables. Those 2 actions are different and can be combined together for better security.
fr_fr: Vous pouvez choisir de filtrer et rejeter les requêtes HTTP dangereuses, mais aussi de les nettoyer. Ces deux actions sont différentes et peuvent être combinées pour plus de sécurité.

source: Scan
fr_fr: Filtrer

source: If anything suspicious is detected, NinjaFirewall will block the request and return an HTTP error code and message. The user request will fail and the connection will be closed immediately.
fr_fr: Lorsqu'il détecte une requête dangereuse, NinjaFirewall la bloque et retourne un message et code d'erreur HTTP. La requête ne pourra pas aboutir et la connexion sera fermée immédiatement.

source: Sanitise
fr_fr: Nettoyer

source: This option will not block but sanitise the user request by escaping characters that can be used to exploit vulnerabilities (<code>'</code>, <code>"</code>, <code>\</code>, <code>\n</code>, <code>\r</code>, <code>`</code>, <code>\x1a</code>, <code>\x00</code>, <code>*</code> and <code>?</code>) and replacing <code>&lt;</code> and <code>&gt;</code> with their corresponding HTML entities (<code>&amp;lt;</code>, <code>&amp;gt;</code>). If it is a variable, i.e. <code>?name=value</code>, both its name and value will be sanitised.
fr_fr: Cette action ne bloque pas la requête mais l'analyse afin d'y trouver des caractères pouvant être dangereux, par exemple pour injecter du code dans la base de données (<code>'</code>, <code>"</code>, <code>\</code>, <code>\n</code>, <code>\r</code>, <code>`</code>, <code>\x1a</code>, <code>\x00</code>, <code>*</code> et <code>?</code>) et, le cas échéant, nettoie cette requête en y insérant des caractères d'échappement ou, dans le cas des caractères < et >, en les remplaçant par leurs entités HTML correspondantes (<code>&amp;lt;</code>, <code>&amp;gt;</code>). S'il s'agit d'une variable et de sa valeur (?variable=valeur), les deux éléments seront nettoyés.

source: This action will be performed when the filtering process is over, right before NinjaFirewall forwards the request to your PHP script.
fr_fr: Veuillez noter que cette action est effectuée en dernier, après le filtrage, juste avant que NinjaFirewall fasse suivre la requête à votre application PHP.

source: Whether to filter HTTP and/or HTTPS traffic.
fr_fr: S'il faut filtrer le trafic HTTP et/ou HTTPS.

source: You can allow/disallow uploads, or allow uploads but block scripts (PHP, CGI, Ruby, Python, bash/shell), C/C++ source code, binaries (MZ/PE/NE and ELF formats), system files (<code>.htaccess</code>, <code>.htpasswd</code> and PHP INI) and SVG files containing Javascript/XML events.
fr_fr: Vous pouvez autoriser ou interdire les téléchargements de fichier vers votre site, ou bien les autoriser sauf s'il s'agit de fichiers potentiellement dangereux : scripts (PHP, CGI, Ruby, Python, bash/shell), code source C/C++, fichiers exécutables (MZ/PE/NE et ELF), certains fichiers systèmes (<code>.htaccess</code>, <code>.htpasswd</code> et PHP INI) et les fichiers SVG contenant du Javascript ou des Événements XML.

source: Any character that is not a letter <code>a-zA-Z</code>, a digit <code>0-9</code>, a dot <code>.</code>, a hyphen <code>-</code> or an underscore <code>_</code> will be removed from the filename and replaced with the substitution character.
fr_fr: Tout caractère qui n'est pas une lettre <code>a-zA-Z</code>, un chiffre <code>0-9</code>, un point <code>.</code>, un trait d'union <code>-</code> ou un caractère de soulignement <code>_</code>, sera remplacé par le caractère de substitution.

source: Maximum allowed file size
fr_fr: Taille maximale autorisée

source: If you allow uploads, you can select the maximum size of an uploaded file. Any file bigger than this value will be rejected. Note that if your PHP configuration uses the <code>upload_max_filesize</code> directive, it will be used before NinjaFirewall.
fr_fr: Vous pouvez sélectionner la taille maximale d'un fichier téléchargé. Tout fichier plus grand que cette taille sera rejeté. Notez que si votre configuration de PHP utilise la directive<code>upload_max_filesize</code>, celle-ci sera prioritaire.

source: Whether to scan and/or sanitise the %s variable.
fr_fr: S'il faut filtrer/nettoyer la variable %s.

source: NinjaFirewall will decode and scan base64 encoded values in order to detect obfuscated malicious code. This option is only available for the <code>POST</code> variable.
fr_fr: NinjaFirewall peut décoder et filtrer les chaînes de caractères encodées en Base64 afin d'y détecter du code malveillant caché.

source: Those 3 options can help to block crawlers, scrappers and spambots.
fr_fr: Ces 3 options peuvent aider à bloquer les crawlers, spambots et autres scrappers.

source: This option will block crawlers, scrappers and spambots.
fr_fr: Cette option peut bloquer de nombreux crawlers, spambots et autres scrappers.

source: This option will block any <code>POST</code> request that does not have a referrer header (<code>HTTP_REFERER</code> variable). If you need external applications to post to your scripts (e.g., Paypal IPN etc), you are advised to keep this option disabled otherwise they will likely be blocked (unless you added them to your IP or URL Access Control whitelist).
fr_fr: Cette option bloque toutes les requêtes <code>POST</code> qui n'incluent pas le Referrer (<code>HTTP_REFERER</code>). Puisque les requêtes POST ne sont pas obligées d'avoir un Referrer, cette option n'est pas activée par défaut. Si vous utilisez des scripts comme Paypal IPN, WordPress WP-Cron etc, désactivez cette fonction.

source: In addition to filtering incoming requests, NinjaFirewall can also hook the HTTP response in order to alter its headers. Those modifications can help to mitigate threats such as XSS, phishing and clickjacking attacks.
fr_fr: En plus de filtrer les requêtes entrantes, NinjaFirewall peut aussi intercepter la réponse HTTP afin de modifier ses en-têtes. Ces modifications peuvent aider à atténuer les menaces telles que les attaques XSS, phishing et clickjacking.

source: This header will send the nosniff value to instruct the browser to disable content or MIME sniffing and to use the content-type returned by the server. Some browsers try to guess (sniff) and override the content-type by looking at the content itself which, in some cases, could lead to security issues such as MIME Confusion Attacks.
fr_fr: Cet en-tête enverra la valeur "nosniff" pour indiquer au navigateur de désactiver le reniflage de contenu ou type MIME et d'utiliser le type retourné par le serveur. Certains navigateurs tentent de deviner (sniff) et de contourner le type de contenu en regardant le contenu lui-même ce qui, dans certains cas, peut entraîner des problèmes de sécurité tels que les attaques basées sur la confusion du type MIME.

source: This header indicates a policy whether a browser must not allow to render a page in a <code>&lt;frame&gt;</code> or <code>&lt;iframe&gt;</code>. Hosts can declare this policy in the header of their HTTP responses to prevent clickjacking attacks, by ensuring that their content is not embedded into other pages or frames. NinjaFirewall accepts two different values:
fr_fr: Cet en-tête informe le navigateur s'il doit autoriser ou non l'affichage d'une page dans une <code>&lt;frame&gt;</code> ou <code>&lt;iframe&gt;</code>. Cela permet d'empêcher les attaques de clickjacking, en veillant à ce que le contenu d'une page ne sont pas intégré dans d'autres pages ou cadres, notamment d'un autre site. NinjaFirewall accepte deux valeurs différentes :

source: <code>SAMEORIGIN</code>: A browser receiving content with this header must not display this content in any frame from a page of different origin than the content itself.
fr_fr: <code>SAMEORIGIN</code>: un navigateur ne doit pas afficher le contenu dans une frame d'une page d'origine différente que le contenu lui-même.

source: <code>DENY</code>: A browser receiving content with this header must not display this content in any frame.
fr_fr: <code>DENY</code> : un navigateur ne doit jamais afficher le contenu dans une frame.

source: This header allows browsers to identify and block XSS attacks by preventing malicious scripts from executing. It is enabled by default on all compatible browsers.
fr_fr: Cet en-tête permet aux navigateurs compatibles d'identifier et bloquer les attaques XSS en empêchant un script malveillant de s'exécuter. Notez que cette option est activée par défaut sur ces navigateurs.

source: If a visitor disable their browser's XSS filter, you cannot re-enable it with that option.
fr_fr: Si un visiteur désactive le filtre XSS de son navigateur, vous ne pouvez pas le réactiver avec cette option.

source: Adding this flag to cookies helps to mitigate the risk of cross-site scripting by preventing them from being accessed through client-side scripts. NinjaFirewall can hook all cookies sent by your blog, its plugins or any other PHP script, add the <code>HttpOnly</code> flag if it is missing, and re-inject those cookies back into your server HTTP response headers right before they are sent to your visitors.
fr_fr: Cette protection permet de diminuer les risques d'attaques XSS en empêchant JavaScript d'accéder aux cookies de l'utilisateur. NinjaFirewall peut intercepter les cookies envoyés par vos scripts PHP, activer la propriété <code>HttpOnly</code> si elle est manquante, puis réinjecter les cookies dans la réponse HTTP juste avant que celle-ci ne soit envoyée à vos visiteurs.
